MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c531xx.h
/* ***********************************  Bit definition for ADC_AWD3HTR register  ************************************ */
#define ADC_AWD3HTR_HTR_Pos      (0U)
#define ADC_AWD3HTR_HTR_Msk      (0x7FFFFFUL << ADC_AWD3HTR_HTR_Pos)   /*!< 0x007FFFFF */
#define ADC_AWD3HTR_HTR          ADC_AWD3HTR_HTR_Msk                   /*!< Analog watchdog 3 higher threshold */
#define ADC_AWD3HTR_HTR_0        (0x1UL << ADC_AWD3HTR_HTR_Pos)        /*!< 0x00000001 */
#define ADC_AWD3HTR_HTR_1        (0x2UL << ADC_AWD3HTR_HTR_Pos)        /*!< 0x00000002 */
#define ADC_AWD3HTR_HTR_2        (0x4UL << ADC_AWD3HTR_HTR_Pos)        /*!< 0x00000004 */
#define ADC_AWD3HTR_HTR_3        (0x8UL << ADC_AWD3HTR_HTR_Pos)        /*!< 0x00000008 */
#define ADC_AWD3HTR_HTR_4        (0x10UL << ADC_AWD3HTR_HTR_Pos)       /*!< 0x00000010 */
#define ADC_AWD3HTR_HTR_5        (0x20UL << ADC_AWD3HTR_HTR_Pos)       /*!< 0x00000020 */
#define ADC_AWD3HTR_HTR_6        (0x40UL << ADC_AWD3HTR_HTR_Pos)       /*!< 0x00000040 */
#define ADC_AWD3HTR_HTR_7        (0x80UL << ADC_AWD3HTR_HTR_Pos)       /*!< 0x00000080 */
#define ADC_AWD3HTR_HTR_8        (0x100UL << ADC_AWD3HTR_HTR_Pos)      /*!< 0x00000100 */
#define ADC_AWD3HTR_HTR_9        (0x200UL << ADC_AWD3HTR_HTR_Pos)      /*!< 0x00000200 */
#define ADC_AWD3HTR_HTR_10       (0x400UL << ADC_AWD3HTR_HTR_Pos)      /*!< 0x00000400 */
#define ADC_AWD3HTR_HTR_11       (0x800UL << ADC_AWD3HTR_HTR_Pos)      /*!< 0x00000800 */
#define ADC_AWD3HTR_HTR_12       (0x1000UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00001000 */
#define ADC_AWD3HTR_HTR_13       (0x2000UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00002000 */
#define ADC_AWD3HTR_HTR_14       (0x4000UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00004000 */
#define ADC_AWD3HTR_HTR_15       (0x8000UL << ADC_AWD3HTR_HTR_Pos)     /*!< 0x00008000 */
#define ADC_AWD3HTR_HTR_16       (0x10000UL << ADC_AWD3HTR_HTR_Pos)    /*!< 0x00010000 */
#define ADC_AWD3HTR_HTR_17       (0x20000UL << ADC_AWD3HTR_HTR_Pos)    /*!< 0x00020000 */
#define ADC_AWD3HTR_HTR_18       (0x40000UL << ADC_AWD3HTR_HTR_Pos)    /*!< 0x00040000 */
#define ADC_AWD3HTR_HTR_19       (0x80000UL << ADC_AWD3HTR_HTR_Pos)    /*!< 0x00080000 */
#define ADC_AWD3HTR_HTR_20       (0x100000UL << ADC_AWD3HTR_HTR_Pos)   /*!< 0x00100000 */
#define ADC_AWD3HTR_HTR_21       (0x200000UL << ADC_AWD3HTR_HTR_Pos)   /*!< 0x00200000 */
#define ADC_AWD3HTR_HTR_22       (0x400000UL << ADC_AWD3HTR_HTR_Pos)   /*!< 0x00400000 */

/* ***********************************  Bit definition for ADC_CALFACT register  ************************************ */
#define ADC_CALFACT_CALFACT_Pos  (0U)
#define ADC_CALFACT_CALFACT_Msk  (0x7FUL << ADC_CALFACT_CALFACT_Pos)   /*!< 0x0000007F */
#define ADC_CALFACT_CALFACT      ADC_CALFACT_CALFACT_Msk               /*!< Calibration factors */
#define ADC_CALFACT_CALFACT_0    (0x1UL << ADC_CALFACT_CALFACT_Pos)    /*!< 0x00000001 */
#define ADC_CALFACT_CALFACT_1    (0x2UL << ADC_CALFACT_CALFACT_Pos)    /*!< 0x00000002 */
#define ADC_CALFACT_CALFACT_2    (0x4UL << ADC_CALFACT_CALFACT_Pos)    /*!< 0x00000004 */
#define ADC_CALFACT_CALFACT_3    (0x8UL << ADC_CALFACT_CALFACT_Pos)    /*!< 0x00000008 */
#define ADC_CALFACT_CALFACT_4    (0x10UL << ADC_CALFACT_CALFACT_Pos)   /*!< 0x00000010 */
#define ADC_CALFACT_CALFACT_5    (0x20UL << ADC_CALFACT_CALFACT_Pos)   /*!< 0x00000020 */
#define ADC_CALFACT_CALFACT_6    (0x40UL << ADC_CALFACT_CALFACT_Pos)   /*!< 0x00000040 */

/* *********************************************  ADC Common registers  ********************************************* */
/* *************************************  Bit definition for ADCC_CSR register  ************************************* */
#define ADCC_CSR_ADRDY_MST_Pos  (0U)
#define ADCC_CSR_ADRDY_MST_Msk  (0x1UL << ADCC_CSR_ADRDY_MST_Pos)    /*!< 0x00000001 */
#define ADCC_CSR_ADRDY_MST      ADCC_CSR_ADRDY_MST_Msk               /*!< Master ADC ready */
#define ADCC_CSR_EOSMP_MST_Pos  (1U)
#define ADCC_CSR_EOSMP_MST_Msk  (0x1UL << ADCC_CSR_EOSMP_MST_Pos)    /*!< 0x00000002 */
#define ADCC_CSR_EOSMP_MST      ADCC_CSR_EOSMP_MST_Msk               /*!< End of Sampling phase flag of the master ADC
                                                                          */
#define ADCC_CSR_EOC_MST_Pos    (2U)
#define ADCC_CSR_EOC_MST_Msk    (0x1UL << ADCC_CSR_EOC_MST_Pos)      /*!< 0x00000004 */
#define ADCC_CSR_EOC_MST        ADCC_CSR_EOC_MST_Msk                 /*!< End of regular conversion of the master ADC */
#define ADCC_CSR_EOS_MST_Pos    (3U)
#define ADCC_CSR_EOS_MST_Msk    (0x1UL << ADCC_CSR_EOS_MST_Pos)      /*!< 0x00000008 */
#define ADCC_CSR_EOS_MST        ADCC_CSR_EOS_MST_Msk                 /*!< End of regular sequence flag of the master ADC
                                                                          */
#define ADCC_CSR_OVR_MST_Pos    (4U)
#define ADCC_CSR_OVR_MST_Msk    (0x1UL << ADCC_CSR_OVR_MST_Pos)      /*!< 0x00000010 */
#define ADCC_CSR_OVR_MST        ADCC_CSR_OVR_MST_Msk                 /*!< Overrun flag of the master ADC */
#define ADCC_CSR_JEOC_MST_Pos   (5U)
#define ADCC_CSR_JEOC_MST_Msk   (0x1UL << ADCC_CSR_JEOC_MST_Pos)     /*!< 0x00000020 */
#define ADCC_CSR_JEOC_MST       ADCC_CSR_JEOC_MST_Msk                /*!< End of injected conversion flag of the master
                                                                          ADC */
#define ADCC_CSR_JEOS_MST_Pos   (6U)
#define ADCC_CSR_JEOS_MST_Msk   (0x1UL << ADCC_CSR_JEOS_MST_Pos)     /*!< 0x00000040 */
#define ADCC_CSR_JEOS_MST       ADCC_CSR_JEOS_MST_Msk                /*!< End of injected sequence flag of the master
                                                                          ADC */
#define ADCC_CSR_AWD1_MST_Pos   (7U)
#define ADCC_CSR_AWD1_MST_Msk   (0x1UL << ADCC_CSR_AWD1_MST_Pos)     /*!< 0x00000080 */
#define ADCC_CSR_AWD1_MST       ADCC_CSR_AWD1_MST_Msk                /*!< Analog watchdog 1 flag of the master ADC */
#define ADCC_CSR_AWD2_MST_Pos   (8U)
#define ADCC_CSR_AWD2_MST_Msk   (0x1UL << ADCC_CSR_AWD2_MST_Pos)     /*!< 0x00000100 */
#define ADCC_CSR_AWD2_MST       ADCC_CSR_AWD2_MST_Msk                /*!< Analog watchdog 2 flag of the master ADC */
#define ADCC_CSR_AWD3_MST_Pos   (9U)
#define ADCC_CSR_AWD3_MST_Msk   (0x1UL << ADCC_CSR_AWD3_MST_Pos)     /*!< 0x00000200 */
#define ADCC_CSR_AWD3_MST       ADCC_CSR_AWD3_MST_Msk                /*!< Analog watchdog 3 flag of the master ADC */
#define ADCC_CSR_LDORDY_MST_Pos (12U)
#define ADCC_CSR_LDORDY_MST_Msk (0x1UL << ADCC_CSR_LDORDY_MST_Pos)   /*!< 0x00001000 */
#define ADCC_CSR_LDORDY_MST     ADCC_CSR_LDORDY_MST_Msk              /*!< ADC internal voltage regulator flag of the
                                                                          master ADC */
#define ADCC_CSR_ADRDY_SLV_Pos  (16U)
#define ADCC_CSR_ADRDY_SLV_Msk  (0x1UL << ADCC_CSR_ADRDY_SLV_Pos)    /*!< 0x00010000 */
#define ADCC_CSR_ADRDY_SLV      ADCC_CSR_ADRDY_SLV_Msk               /*!< Slave ADC ready */
#define ADCC_CSR_EOSMP_SLV_Pos  (17U)
#define ADCC_CSR_EOSMP_SLV_Msk  (0x1UL << ADCC_CSR_EOSMP_SLV_Pos)    /*!< 0x00020000 */
#define ADCC_CSR_EOSMP_SLV      ADCC_CSR_EOSMP_SLV_Msk               /*!< End of sampling phase flag of the slave ADC */
#define ADCC_CSR_EOC_SLV_Pos    (18U)
#define ADCC_CSR_EOC_SLV_Msk    (0x1UL << ADCC_CSR_EOC_SLV_Pos)      /*!< 0x00040000 */
#define ADCC_CSR_EOC_SLV        ADCC_CSR_EOC_SLV_Msk                 /*!< End of regular conversion of the slave ADC */
#define ADCC_CSR_EOS_SLV_Pos    (19U)
#define ADCC_CSR_EOS_SLV_Msk    (0x1UL << ADCC_CSR_EOS_SLV_Pos)      /*!< 0x00080000 */
#define ADCC_CSR_EOS_SLV        ADCC_CSR_EOS_SLV_Msk                 /*!< End of regular sequence flag of the slave ADC
                                                                          */
#define ADCC_CSR_OVR_SLV_Pos    (20U)
#define ADCC_CSR_OVR_SLV_Msk    (0x1UL << ADCC_CSR_OVR_SLV_Pos)      /*!< 0x00100000 */
#define ADCC_CSR_OVR_SLV        ADCC_CSR_OVR_SLV_Msk                 /*!< Overrun flag of the slave ADC */
#define ADCC_CSR_JEOC_SLV_Pos   (21U)
#define ADCC_CSR_JEOC_SLV_Msk   (0x1UL << ADCC_CSR_JEOC_SLV_Pos)     /*!< 0x00200000 */
#define ADCC_CSR_JEOC_SLV       ADCC_CSR_JEOC_SLV_Msk                /*!< End of injected conversion flag of the slave
                                                                          ADC */
#define ADCC_CSR_JEOS_SLV_Pos   (22U)
#define ADCC_CSR_JEOS_SLV_Msk   (0x1UL << ADCC_CSR_JEOS_SLV_Pos)     /*!< 0x00400000 */
#define ADCC_CSR_JEOS_SLV       ADCC_CSR_JEOS_SLV_Msk                /*!< End of injected sequence flag of the slave ADC
                                                                          */
#define ADCC_CSR_AWD1_SLV_Pos   (23U)
#define ADCC_CSR_AWD1_SLV_Msk   (0x1UL << ADCC_CSR_AWD1_SLV_Pos)     /*!< 0x00800000 */
#define ADCC_CSR_AWD1_SLV       ADCC_CSR_AWD1_SLV_Msk                /*!< Analog watchdog 1 flag of the slave ADC */
#define ADCC_CSR_AWD2_SLV_Pos   (24U)
#define ADCC_CSR_AWD2_SLV_Msk   (0x1UL << ADCC_CSR_AWD2_SLV_Pos)     /*!< 0x01000000 */
#define ADCC_CSR_AWD2_SLV       ADCC_CSR_AWD2_SLV_Msk                /*!< Analog watchdog 2 flag of the slave ADC */
#define ADCC_CSR_AWD3_SLV_Pos   (25U)
#define ADCC_CSR_AWD3_SLV_Msk   (0x1UL << ADCC_CSR_AWD3_SLV_Pos)     /*!< 0x02000000 */
#define ADCC_CSR_AWD3_SLV       ADCC_CSR_AWD3_SLV_Msk                /*!< Analog watchdog 3 flag of the slave ADC */
#define ADCC_CSR_LDORDY_SLV_Pos (28U)
#define ADCC_CSR_LDORDY_SLV_Msk (0x1UL << ADCC_CSR_LDORDY_SLV_Pos)   /*!< 0x10000000 */
#define ADCC_CSR_LDORDY_SLV     ADCC_CSR_LDORDY_SLV_Msk              /*!< ADC internal voltage regulator flag of the
                                                                          slave ADC */

/* *************************************  Bit definition for ADCC_CCR register  ************************************* */
#define ADCC_CCR_DUAL_Pos       (0U)
#define ADCC_CCR_DUAL_Msk       (0x1FUL << ADCC_CCR_DUAL_Pos)        /*!< 0x0000001F */
#define ADCC_CCR_DUAL           ADCC_CCR_DUAL_Msk                    /*!< Dual ADC mode selection */
#define ADCC_CCR_DUAL_0         (0x1UL << ADCC_CCR_DUAL_Pos)         /*!< 0x00000001 */
#define ADCC_CCR_DUAL_1         (0x2UL << ADCC_CCR_DUAL_Pos)         /*!< 0x00000002 */
#define ADCC_CCR_DUAL_2         (0x4UL << ADCC_CCR_DUAL_Pos)         /*!< 0x00000004 */
#define ADCC_CCR_DUAL_3         (0x8UL << ADCC_CCR_DUAL_Pos)         /*!< 0x00000008 */
#define ADCC_CCR_DUAL_4         (0x10UL << ADCC_CCR_DUAL_Pos)        /*!< 0x00000010 */
#define ADCC_CCR_DELAY_Pos      (8U)
#define ADCC_CCR_DELAY_Msk      (0xFUL << ADCC_CCR_DELAY_Pos)        /*!< 0x00000F00 */
#define ADCC_CCR_DELAY          ADCC_CCR_DELAY_Msk                   /*!< Delay between two sampling phases */
#define ADCC_CCR_DELAY_0        (0x1UL << ADCC_CCR_DELAY_Pos)        /*!< 0x00000100 */
#define ADCC_CCR_DELAY_1        (0x2UL << ADCC_CCR_DELAY_Pos)        /*!< 0x00000200 */
#define ADCC_CCR_DELAY_2        (0x4UL << ADCC_CCR_DELAY_Pos)        /*!< 0x00000400 */
#define ADCC_CCR_DELAY_3        (0x8UL << ADCC_CCR_DELAY_Pos)        /*!< 0x00000800 */
#define ADCC_CCR_DAMDF_Pos      (14U)
#define ADCC_CCR_DAMDF_Msk      (0x3UL << ADCC_CCR_DAMDF_Pos)        /*!< 0x0000C000 */
#define ADCC_CCR_DAMDF          ADCC_CCR_DAMDF_Msk                   /*!< Dual ADC mode data format */
#define ADCC_CCR_DAMDF_0        (0x1UL << ADCC_CCR_DAMDF_Pos)        /*!< 0x00004000 */
#define ADCC_CCR_DAMDF_1        (0x2UL << ADCC_CCR_DAMDF_Pos)        /*!< 0x00008000 */
#define ADCC_CCR_VREFEN_Pos     (22U)
#define ADCC_CCR_VREFEN_Msk     (0x1UL << ADCC_CCR_VREFEN_Pos)       /*!< 0x00400000 */
#define ADCC_CCR_VREFEN         ADCC_CCR_VREFEN_Msk                  /*!< V<sub>REFINT</sub> enable */
#define ADCC_CCR_TSEN_Pos       (23U)
#define ADCC_CCR_TSEN_Msk       (0x1UL << ADCC_CCR_TSEN_Pos)         /*!< 0x00800000 */
#define ADCC_CCR_TSEN           ADCC_CCR_TSEN_Msk                    /*!< Temperature sensor voltage enable */

/* *************************************  Bit definition for ADCC_CDR register  ************************************* */
#define ADCC_CDR_RDATA_MST_Pos  (0U)
#define ADCC_CDR_RDATA_MST_Msk  (0xFFFFUL << ADCC_CDR_RDATA_MST_Pos) /*!< 0x0000FFFF */
#define ADCC_CDR_RDATA_MST      ADCC_CDR_RDATA_MST_Msk               /*!< Regular data of the master ADC. */
#define ADCC_CDR_RDATA_SLV_Pos  (16U)
#define ADCC_CDR_RDATA_SLV_Msk  (0xFFFFUL << ADCC_CDR_RDATA_SLV_Pos) /*!< 0xFFFF0000 */
#define ADCC_CDR_RDATA_SLV      ADCC_CDR_RDATA_SLV_Msk               /*!< Regular data of the slave ADC */

