MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c531xx.h
/**********************************************************************************************************************/
/*                                                                                                                    */
/*                               Extended interrupts and event controller (EXTI)                                      */
/*                                                                                                                    */
/**********************************************************************************************************************/
/* ************************************  Bit definition for EXTI_RTSR1 register  ************************************ */
#define EXTI_RTSR1_RT0_Pos        (0U)
#define EXTI_RTSR1_RT0_Msk        (0x1UL << EXTI_RTSR1_RT0_Pos)          /*!< 0x00000001 */
#define EXTI_RTSR1_RT0            EXTI_RTSR1_RT0_Msk                     /*!< Rising trigger event configuration bit of
                                                                              configurable event input 0 */
#define EXTI_RTSR1_RT1_Pos        (1U)
#define EXTI_RTSR1_RT1_Msk        (0x1UL << EXTI_RTSR1_RT1_Pos)          /*!< 0x00000002 */
#define EXTI_RTSR1_RT1            EXTI_RTSR1_RT1_Msk                     /*!< Rising trigger event configuration bit of
                                                                              configurable event input 1 */
#define EXTI_RTSR1_RT2_Pos        (2U)
#define EXTI_RTSR1_RT2_Msk        (0x1UL << EXTI_RTSR1_RT2_Pos)          /*!< 0x00000004 */
#define EXTI_RTSR1_RT2            EXTI_RTSR1_RT2_Msk                     /*!< Rising trigger event configuration bit of
                                                                              configurable event input 2 */
#define EXTI_RTSR1_RT3_Pos        (3U)
#define EXTI_RTSR1_RT3_Msk        (0x1UL << EXTI_RTSR1_RT3_Pos)          /*!< 0x00000008 */
#define EXTI_RTSR1_RT3            EXTI_RTSR1_RT3_Msk                     /*!< Rising trigger event configuration bit of
                                                                              configurable event input 3 */
#define EXTI_RTSR1_RT4_Pos        (4U)
#define EXTI_RTSR1_RT4_Msk        (0x1UL << EXTI_RTSR1_RT4_Pos)          /*!< 0x00000010 */
#define EXTI_RTSR1_RT4            EXTI_RTSR1_RT4_Msk                     /*!< Rising trigger event configuration bit of
                                                                              configurable event input 4 */
#define EXTI_RTSR1_RT5_Pos        (5U)
#define EXTI_RTSR1_RT5_Msk        (0x1UL << EXTI_RTSR1_RT5_Pos)          /*!< 0x00000020 */
#define EXTI_RTSR1_RT5            EXTI_RTSR1_RT5_Msk                     /*!< Rising trigger event configuration bit of
                                                                              configurable event input 5 */
#define EXTI_RTSR1_RT6_Pos        (6U)
#define EXTI_RTSR1_RT6_Msk        (0x1UL << EXTI_RTSR1_RT6_Pos)          /*!< 0x00000040 */
#define EXTI_RTSR1_RT6            EXTI_RTSR1_RT6_Msk                     /*!< Rising trigger event configuration bit of
                                                                              configurable event input 6 */
#define EXTI_RTSR1_RT7_Pos        (7U)
#define EXTI_RTSR1_RT7_Msk        (0x1UL << EXTI_RTSR1_RT7_Pos)          /*!< 0x00000080 */
#define EXTI_RTSR1_RT7            EXTI_RTSR1_RT7_Msk                     /*!< Rising trigger event configuration bit of
                                                                              configurable event input 7 */
#define EXTI_RTSR1_RT8_Pos        (8U)
#define EXTI_RTSR1_RT8_Msk        (0x1UL << EXTI_RTSR1_RT8_Pos)          /*!< 0x00000100 */
#define EXTI_RTSR1_RT8            EXTI_RTSR1_RT8_Msk                     /*!< Rising trigger event configuration bit of
                                                                              configurable event input 8 */
#define EXTI_RTSR1_RT9_Pos        (9U)
#define EXTI_RTSR1_RT9_Msk        (0x1UL << EXTI_RTSR1_RT9_Pos)          /*!< 0x00000200 */
#define EXTI_RTSR1_RT9            EXTI_RTSR1_RT9_Msk                     /*!< Rising trigger event configuration bit of
                                                                              configurable event input 9 */
#define EXTI_RTSR1_RT10_Pos       (10U)
#define EXTI_RTSR1_RT10_Msk       (0x1UL << EXTI_RTSR1_RT10_Pos)         /*!< 0x00000400 */
#define EXTI_RTSR1_RT10           EXTI_RTSR1_RT10_Msk                    /*!< Rising trigger event configuration bit of
                                                                              configurable event input 10 */
#define EXTI_RTSR1_RT11_Pos       (11U)
#define EXTI_RTSR1_RT11_Msk       (0x1UL << EXTI_RTSR1_RT11_Pos)         /*!< 0x00000800 */
#define EXTI_RTSR1_RT11           EXTI_RTSR1_RT11_Msk                    /*!< Rising trigger event configuration bit of
                                                                              configurable event input 11 */
#define EXTI_RTSR1_RT12_Pos       (12U)
#define EXTI_RTSR1_RT12_Msk       (0x1UL << EXTI_RTSR1_RT12_Pos)         /*!< 0x00001000 */
#define EXTI_RTSR1_RT12           EXTI_RTSR1_RT12_Msk                    /*!< Rising trigger event configuration bit of
                                                                              configurable event input 12 */
#define EXTI_RTSR1_RT13_Pos       (13U)
#define EXTI_RTSR1_RT13_Msk       (0x1UL << EXTI_RTSR1_RT13_Pos)         /*!< 0x00002000 */
#define EXTI_RTSR1_RT13           EXTI_RTSR1_RT13_Msk                    /*!< Rising trigger event configuration bit of
                                                                              configurable event input 13 */
#define EXTI_RTSR1_RT14_Pos       (14U)
#define EXTI_RTSR1_RT14_Msk       (0x1UL << EXTI_RTSR1_RT14_Pos)         /*!< 0x00004000 */
#define EXTI_RTSR1_RT14           EXTI_RTSR1_RT14_Msk                    /*!< Rising trigger event configuration bit of
                                                                              configurable event input 14 */
#define EXTI_RTSR1_RT15_Pos       (15U)
#define EXTI_RTSR1_RT15_Msk       (0x1UL << EXTI_RTSR1_RT15_Pos)         /*!< 0x00008000 */
#define EXTI_RTSR1_RT15           EXTI_RTSR1_RT15_Msk                    /*!< Rising trigger event configuration bit of
                                                                              configurable event input 15 */
#define EXTI_RTSR1_RT16_Pos       (16U)
#define EXTI_RTSR1_RT16_Msk       (0x1UL << EXTI_RTSR1_RT16_Pos)         /*!< 0x00010000 */
#define EXTI_RTSR1_RT16           EXTI_RTSR1_RT16_Msk                    /*!< Rising trigger event configuration bit of
                                                                              configurable event input 16 */

/* ************************************  Bit definition for EXTI_FTSR1 register  ************************************ */
#define EXTI_FTSR1_FT0_Pos        (0U)
#define EXTI_FTSR1_FT0_Msk        (0x1UL << EXTI_FTSR1_FT0_Pos)          /*!< 0x00000001 */
#define EXTI_FTSR1_FT0            EXTI_FTSR1_FT0_Msk                     /*!< Falling trigger event configuration bit of
                                                                              configurable event input 0 */
#define EXTI_FTSR1_FT1_Pos        (1U)
#define EXTI_FTSR1_FT1_Msk        (0x1UL << EXTI_FTSR1_FT1_Pos)          /*!< 0x00000002 */
#define EXTI_FTSR1_FT1            EXTI_FTSR1_FT1_Msk                     /*!< Falling trigger event configuration bit of
                                                                              configurable event input 1 */
#define EXTI_FTSR1_FT2_Pos        (2U)
#define EXTI_FTSR1_FT2_Msk        (0x1UL << EXTI_FTSR1_FT2_Pos)          /*!< 0x00000004 */
#define EXTI_FTSR1_FT2            EXTI_FTSR1_FT2_Msk                     /*!< Falling trigger event configuration bit of
                                                                              configurable event input 2 */
#define EXTI_FTSR1_FT3_Pos        (3U)
#define EXTI_FTSR1_FT3_Msk        (0x1UL << EXTI_FTSR1_FT3_Pos)          /*!< 0x00000008 */
#define EXTI_FTSR1_FT3            EXTI_FTSR1_FT3_Msk                     /*!< Falling trigger event configuration bit of
                                                                              configurable event input 3 */
#define EXTI_FTSR1_FT4_Pos        (4U)
#define EXTI_FTSR1_FT4_Msk        (0x1UL << EXTI_FTSR1_FT4_Pos)          /*!< 0x00000010 */
#define EXTI_FTSR1_FT4            EXTI_FTSR1_FT4_Msk                     /*!< Falling trigger event configuration bit of
                                                                              configurable event input 4 */
#define EXTI_FTSR1_FT5_Pos        (5U)
#define EXTI_FTSR1_FT5_Msk        (0x1UL << EXTI_FTSR1_FT5_Pos)          /*!< 0x00000020 */
#define EXTI_FTSR1_FT5            EXTI_FTSR1_FT5_Msk                     /*!< Falling trigger event configuration bit of
                                                                              configurable event input 5 */
#define EXTI_FTSR1_FT6_Pos        (6U)
#define EXTI_FTSR1_FT6_Msk        (0x1UL << EXTI_FTSR1_FT6_Pos)          /*!< 0x00000040 */
#define EXTI_FTSR1_FT6            EXTI_FTSR1_FT6_Msk                     /*!< Falling trigger event configuration bit of
                                                                              configurable event input 6 */
#define EXTI_FTSR1_FT7_Pos        (7U)
#define EXTI_FTSR1_FT7_Msk        (0x1UL << EXTI_FTSR1_FT7_Pos)          /*!< 0x00000080 */
#define EXTI_FTSR1_FT7            EXTI_FTSR1_FT7_Msk                     /*!< Falling trigger event configuration bit of
                                                                              configurable event input 7 */
#define EXTI_FTSR1_FT8_Pos        (8U)
#define EXTI_FTSR1_FT8_Msk        (0x1UL << EXTI_FTSR1_FT8_Pos)          /*!< 0x00000100 */
#define EXTI_FTSR1_FT8            EXTI_FTSR1_FT8_Msk                     /*!< Falling trigger event configuration bit of
                                                                              configurable event input 8 */
#define EXTI_FTSR1_FT9_Pos        (9U)
#define EXTI_FTSR1_FT9_Msk        (0x1UL << EXTI_FTSR1_FT9_Pos)          /*!< 0x00000200 */
#define EXTI_FTSR1_FT9            EXTI_FTSR1_FT9_Msk                     /*!< Falling trigger event configuration bit of
                                                                              configurable event input 9 */
#define EXTI_FTSR1_FT10_Pos       (10U)
#define EXTI_FTSR1_FT10_Msk       (0x1UL << EXTI_FTSR1_FT10_Pos)         /*!< 0x00000400 */
#define EXTI_FTSR1_FT10           EXTI_FTSR1_FT10_Msk                    /*!< Falling trigger event configuration bit of
                                                                              configurable event input 10 */
#define EXTI_FTSR1_FT11_Pos       (11U)
#define EXTI_FTSR1_FT11_Msk       (0x1UL << EXTI_FTSR1_FT11_Pos)         /*!< 0x00000800 */
#define EXTI_FTSR1_FT11           EXTI_FTSR1_FT11_Msk                    /*!< Falling trigger event configuration bit of
                                                                              configurable event input 11 */
#define EXTI_FTSR1_FT12_Pos       (12U)
#define EXTI_FTSR1_FT12_Msk       (0x1UL << EXTI_FTSR1_FT12_Pos)         /*!< 0x00001000 */
#define EXTI_FTSR1_FT12           EXTI_FTSR1_FT12_Msk                    /*!< Falling trigger event configuration bit of
                                                                              configurable event input 12 */
#define EXTI_FTSR1_FT13_Pos       (13U)
#define EXTI_FTSR1_FT13_Msk       (0x1UL << EXTI_FTSR1_FT13_Pos)         /*!< 0x00002000 */
#define EXTI_FTSR1_FT13           EXTI_FTSR1_FT13_Msk                    /*!< Falling trigger event configuration bit of
                                                                              configurable event input 13 */
#define EXTI_FTSR1_FT14_Pos       (14U)
#define EXTI_FTSR1_FT14_Msk       (0x1UL << EXTI_FTSR1_FT14_Pos)         /*!< 0x00004000 */
#define EXTI_FTSR1_FT14           EXTI_FTSR1_FT14_Msk                    /*!< Falling trigger event configuration bit of
                                                                              configurable event input 14 */
#define EXTI_FTSR1_FT15_Pos       (15U)
#define EXTI_FTSR1_FT15_Msk       (0x1UL << EXTI_FTSR1_FT15_Pos)         /*!< 0x00008000 */
#define EXTI_FTSR1_FT15           EXTI_FTSR1_FT15_Msk                    /*!< Falling trigger event configuration bit of
                                                                              configurable event input 15 */
#define EXTI_FTSR1_FT16_Pos       (16U)
#define EXTI_FTSR1_FT16_Msk       (0x1UL << EXTI_FTSR1_FT16_Pos)         /*!< 0x00010000 */
#define EXTI_FTSR1_FT16           EXTI_FTSR1_FT16_Msk                    /*!< Falling trigger event configuration bit of
                                                                              configurable event input 16 */

/* ***********************************  Bit definition for EXTI_SWIER1 register  ************************************ */
#define EXTI_SWIER1_SWI0_Pos      (0U)
#define EXTI_SWIER1_SWI0_Msk      (0x1UL << EXTI_SWIER1_SWI0_Pos)        /*!< 0x00000001 */
#define EXTI_SWIER1_SWI0          EXTI_SWIER1_SWI0_Msk                   /*!< Software interrupt on event 0 */
#define EXTI_SWIER1_SWI1_Pos      (1U)
#define EXTI_SWIER1_SWI1_Msk      (0x1UL << EXTI_SWIER1_SWI1_Pos)        /*!< 0x00000002 */
#define EXTI_SWIER1_SWI1          EXTI_SWIER1_SWI1_Msk                   /*!< Software interrupt on event 1 */
#define EXTI_SWIER1_SWI2_Pos      (2U)
#define EXTI_SWIER1_SWI2_Msk      (0x1UL << EXTI_SWIER1_SWI2_Pos)        /*!< 0x00000004 */
#define EXTI_SWIER1_SWI2          EXTI_SWIER1_SWI2_Msk                   /*!< Software interrupt on event 2 */
#define EXTI_SWIER1_SWI3_Pos      (3U)
#define EXTI_SWIER1_SWI3_Msk      (0x1UL << EXTI_SWIER1_SWI3_Pos)        /*!< 0x00000008 */
#define EXTI_SWIER1_SWI3          EXTI_SWIER1_SWI3_Msk                   /*!< Software interrupt on event 3 */
#define EXTI_SWIER1_SWI4_Pos      (4U)
#define EXTI_SWIER1_SWI4_Msk      (0x1UL << EXTI_SWIER1_SWI4_Pos)        /*!< 0x00000010 */
#define EXTI_SWIER1_SWI4          EXTI_SWIER1_SWI4_Msk                   /*!< Software interrupt on event 4 */
#define EXTI_SWIER1_SWI5_Pos      (5U)
#define EXTI_SWIER1_SWI5_Msk      (0x1UL << EXTI_SWIER1_SWI5_Pos)        /*!< 0x00000020 */
#define EXTI_SWIER1_SWI5          EXTI_SWIER1_SWI5_Msk                   /*!< Software interrupt on event 5 */
#define EXTI_SWIER1_SWI6_Pos      (6U)
#define EXTI_SWIER1_SWI6_Msk      (0x1UL << EXTI_SWIER1_SWI6_Pos)        /*!< 0x00000040 */
#define EXTI_SWIER1_SWI6          EXTI_SWIER1_SWI6_Msk                   /*!< Software interrupt on event 6 */
#define EXTI_SWIER1_SWI7_Pos      (7U)
#define EXTI_SWIER1_SWI7_Msk      (0x1UL << EXTI_SWIER1_SWI7_Pos)        /*!< 0x00000080 */
#define EXTI_SWIER1_SWI7          EXTI_SWIER1_SWI7_Msk                   /*!< Software interrupt on event 7 */
#define EXTI_SWIER1_SWI8_Pos      (8U)
#define EXTI_SWIER1_SWI8_Msk      (0x1UL << EXTI_SWIER1_SWI8_Pos)        /*!< 0x00000100 */
#define EXTI_SWIER1_SWI8          EXTI_SWIER1_SWI8_Msk                   /*!< Software interrupt on event 8 */
#define EXTI_SWIER1_SWI9_Pos      (9U)
#define EXTI_SWIER1_SWI9_Msk      (0x1UL << EXTI_SWIER1_SWI9_Pos)        /*!< 0x00000200 */
#define EXTI_SWIER1_SWI9          EXTI_SWIER1_SWI9_Msk                   /*!< Software interrupt on event 9 */
#define EXTI_SWIER1_SWI10_Pos     (10U)
#define EXTI_SWIER1_SWI10_Msk     (0x1UL << EXTI_SWIER1_SWI10_Pos)       /*!< 0x00000400 */
#define EXTI_SWIER1_SWI10         EXTI_SWIER1_SWI10_Msk                  /*!< Software interrupt on event 10 */
#define EXTI_SWIER1_SWI11_Pos     (11U)
#define EXTI_SWIER1_SWI11_Msk     (0x1UL << EXTI_SWIER1_SWI11_Pos)       /*!< 0x00000800 */
#define EXTI_SWIER1_SWI11         EXTI_SWIER1_SWI11_Msk                  /*!< Software interrupt on event 11 */
#define EXTI_SWIER1_SWI12_Pos     (12U)
#define EXTI_SWIER1_SWI12_Msk     (0x1UL << EXTI_SWIER1_SWI12_Pos)       /*!< 0x00001000 */
#define EXTI_SWIER1_SWI12         EXTI_SWIER1_SWI12_Msk                  /*!< Software interrupt on event 12 */
#define EXTI_SWIER1_SWI13_Pos     (13U)
#define EXTI_SWIER1_SWI13_Msk     (0x1UL << EXTI_SWIER1_SWI13_Pos)       /*!< 0x00002000 */
#define EXTI_SWIER1_SWI13         EXTI_SWIER1_SWI13_Msk                  /*!< Software interrupt on event 13 */
#define EXTI_SWIER1_SWI14_Pos     (14U)
#define EXTI_SWIER1_SWI14_Msk     (0x1UL << EXTI_SWIER1_SWI14_Pos)       /*!< 0x00004000 */
#define EXTI_SWIER1_SWI14         EXTI_SWIER1_SWI14_Msk                  /*!< Software interrupt on event 14 */
#define EXTI_SWIER1_SWI15_Pos     (15U)
#define EXTI_SWIER1_SWI15_Msk     (0x1UL << EXTI_SWIER1_SWI15_Pos)       /*!< 0x00008000 */
#define EXTI_SWIER1_SWI15         EXTI_SWIER1_SWI15_Msk                  /*!< Software interrupt on event 15 */
#define EXTI_SWIER1_SWI16_Pos     (16U)
#define EXTI_SWIER1_SWI16_Msk     (0x1UL << EXTI_SWIER1_SWI16_Pos)       /*!< 0x00010000 */
#define EXTI_SWIER1_SWI16         EXTI_SWIER1_SWI16_Msk                  /*!< Software interrupt on event 16 */

/* ************************************  Bit definition for EXTI_RPR1 register  ************************************* */
#define EXTI_RPR1_RPIF0_Pos       (0U)
#define EXTI_RPR1_RPIF0_Msk       (0x1UL << EXTI_RPR1_RPIF0_Pos)         /*!< 0x00000001 */
#define EXTI_RPR1_RPIF0           EXTI_RPR1_RPIF0_Msk                    /*!< configurable event input 0 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF1_Pos       (1U)
#define EXTI_RPR1_RPIF1_Msk       (0x1UL << EXTI_RPR1_RPIF1_Pos)         /*!< 0x00000002 */
#define EXTI_RPR1_RPIF1           EXTI_RPR1_RPIF1_Msk                    /*!< configurable event input 1 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF2_Pos       (2U)
#define EXTI_RPR1_RPIF2_Msk       (0x1UL << EXTI_RPR1_RPIF2_Pos)         /*!< 0x00000004 */
#define EXTI_RPR1_RPIF2           EXTI_RPR1_RPIF2_Msk                    /*!< configurable event input 2 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF3_Pos       (3U)
#define EXTI_RPR1_RPIF3_Msk       (0x1UL << EXTI_RPR1_RPIF3_Pos)         /*!< 0x00000008 */
#define EXTI_RPR1_RPIF3           EXTI_RPR1_RPIF3_Msk                    /*!< configurable event input 3 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF4_Pos       (4U)
#define EXTI_RPR1_RPIF4_Msk       (0x1UL << EXTI_RPR1_RPIF4_Pos)         /*!< 0x00000010 */
#define EXTI_RPR1_RPIF4           EXTI_RPR1_RPIF4_Msk                    /*!< configurable event input 4 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF5_Pos       (5U)
#define EXTI_RPR1_RPIF5_Msk       (0x1UL << EXTI_RPR1_RPIF5_Pos)         /*!< 0x00000020 */
#define EXTI_RPR1_RPIF5           EXTI_RPR1_RPIF5_Msk                    /*!< configurable event input 5 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF6_Pos       (6U)
#define EXTI_RPR1_RPIF6_Msk       (0x1UL << EXTI_RPR1_RPIF6_Pos)         /*!< 0x00000040 */
#define EXTI_RPR1_RPIF6           EXTI_RPR1_RPIF6_Msk                    /*!< configurable event input 6 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF7_Pos       (7U)
#define EXTI_RPR1_RPIF7_Msk       (0x1UL << EXTI_RPR1_RPIF7_Pos)         /*!< 0x00000080 */
#define EXTI_RPR1_RPIF7           EXTI_RPR1_RPIF7_Msk                    /*!< configurable event input 7 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF8_Pos       (8U)
#define EXTI_RPR1_RPIF8_Msk       (0x1UL << EXTI_RPR1_RPIF8_Pos)         /*!< 0x00000100 */
#define EXTI_RPR1_RPIF8           EXTI_RPR1_RPIF8_Msk                    /*!< configurable event input 8 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF9_Pos       (9U)
#define EXTI_RPR1_RPIF9_Msk       (0x1UL << EXTI_RPR1_RPIF9_Pos)         /*!< 0x00000200 */
#define EXTI_RPR1_RPIF9           EXTI_RPR1_RPIF9_Msk                    /*!< configurable event input 9 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF10_Pos      (10U)
#define EXTI_RPR1_RPIF10_Msk      (0x1UL << EXTI_RPR1_RPIF10_Pos)        /*!< 0x00000400 */
#define EXTI_RPR1_RPIF10          EXTI_RPR1_RPIF10_Msk                   /*!< configurable event input 10 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF11_Pos      (11U)
#define EXTI_RPR1_RPIF11_Msk      (0x1UL << EXTI_RPR1_RPIF11_Pos)        /*!< 0x00000800 */
#define EXTI_RPR1_RPIF11          EXTI_RPR1_RPIF11_Msk                   /*!< configurable event input 11 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF12_Pos      (12U)
#define EXTI_RPR1_RPIF12_Msk      (0x1UL << EXTI_RPR1_RPIF12_Pos)        /*!< 0x00001000 */
#define EXTI_RPR1_RPIF12          EXTI_RPR1_RPIF12_Msk                   /*!< configurable event input 12 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF13_Pos      (13U)
#define EXTI_RPR1_RPIF13_Msk      (0x1UL << EXTI_RPR1_RPIF13_Pos)        /*!< 0x00002000 */
#define EXTI_RPR1_RPIF13          EXTI_RPR1_RPIF13_Msk                   /*!< configurable event input 13 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF14_Pos      (14U)
#define EXTI_RPR1_RPIF14_Msk      (0x1UL << EXTI_RPR1_RPIF14_Pos)        /*!< 0x00004000 */
#define EXTI_RPR1_RPIF14          EXTI_RPR1_RPIF14_Msk                   /*!< configurable event input 14 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF15_Pos      (15U)
#define EXTI_RPR1_RPIF15_Msk      (0x1UL << EXTI_RPR1_RPIF15_Pos)        /*!< 0x00008000 */
#define EXTI_RPR1_RPIF15          EXTI_RPR1_RPIF15_Msk                   /*!< configurable event input 15 rising edge
                                                                              pending bit */
#define EXTI_RPR1_RPIF16_Pos      (16U)
#define EXTI_RPR1_RPIF16_Msk      (0x1UL << EXTI_RPR1_RPIF16_Pos)        /*!< 0x00010000 */
#define EXTI_RPR1_RPIF16          EXTI_RPR1_RPIF16_Msk                   /*!< configurable event input 16 rising edge
                                                                              pending bit */

