MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c531xx.h
/* ************************************  Bit definition for EXTI_EMR2 register  ************************************* */
#define EXTI_EMR2_EM32_Pos        (0U)
#define EXTI_EMR2_EM32_Msk        (0x1UL << EXTI_EMR2_EM32_Pos)          /*!< 0x00000001 */
#define EXTI_EMR2_EM32            EXTI_EMR2_EM32_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 32 */
#define EXTI_EMR2_EM33_Pos        (1U)
#define EXTI_EMR2_EM33_Msk        (0x1UL << EXTI_EMR2_EM33_Pos)          /*!< 0x00000002 */
#define EXTI_EMR2_EM33            EXTI_EMR2_EM33_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 33 */
#define EXTI_EMR2_EM34_Pos        (2U)
#define EXTI_EMR2_EM34_Msk        (0x1UL << EXTI_EMR2_EM34_Pos)          /*!< 0x00000004 */
#define EXTI_EMR2_EM34            EXTI_EMR2_EM34_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 34 */
#define EXTI_EMR2_EM35_Pos        (3U)
#define EXTI_EMR2_EM35_Msk        (0x1UL << EXTI_EMR2_EM35_Pos)          /*!< 0x00000008 */
#define EXTI_EMR2_EM35            EXTI_EMR2_EM35_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 35 */
#define EXTI_EMR2_EM36_Pos        (4U)
#define EXTI_EMR2_EM36_Msk        (0x1UL << EXTI_EMR2_EM36_Pos)          /*!< 0x00000010 */
#define EXTI_EMR2_EM36            EXTI_EMR2_EM36_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 36 */


/**********************************************************************************************************************/
/*                                                                                                                    */
/*                                            Code FLASH registers (FLASH)                                            */
/*                                                                                                                    */
/**********************************************************************************************************************/
#define FLASH_LATENCY_DEFAULT        FLASH_ACR_LATENCY_3WS                               /* FLASH Three
                                                                                            Latency cycles   */
#define FLASH_BLOCKBASED_NB_REG      (1U)                                                /* 1 Block-based
                                                                                            registers for
                                                                                            each Flash bank */

#define FLASH_SIZE_MAX               (0x00040000UL)                                      /* 256 Kbytes user flash */
#define FLASH_PAGE_NB_MAX            (0x10U)                                             /* Page number in bank */
#define FLASH_SIZE                   ((((*((uint16_t *)FLASHSIZE_BASE)) == 0xFFFFU)) ? FLASH_SIZE_MAX : \
                                     ((((*((uint16_t *)FLASHSIZE_BASE)) == 0x0000U)) ? FLASH_SIZE_MAX : \
                                     (((uint32_t)(*((uint16_t *)FLASHSIZE_BASE)) & (0xFFFFU)) << 10U)))
#define FLASH_OTP_SIZE               (0x1200U)                                           /* 2 Kbytes OTP
                                                                                            (one-time programmable)
                                                                                            */
#define FLASH_EXT_USER_SIZE          (0x10000UL)                                         /* 64 Kbytes of Flash
                                                                                            extended memory
                                                                                            if configured
                                                                                            as user flash */
#define FLASH_EDATA_SIZE             (0xC000U)                                           /* 48 Kbytes of Flash
                                                                                            data memory
                                                                                            if configured
                                                                                            as data flash */
#define FLASH_BANK_SIZE              (FLASH_SIZE >> 1U)                                  /* 256 Kbytes per bank
                                                                                             */
#define FLASH_PAGE_SIZE              0x2000U                                             /* 8 Kbytes pages
                                                                                            */
#define FLASH_EXT_USER_BANK_SIZE     (FLASH_EXT_USER_SIZE >> 1U)
#define FLASH_EXT_USER_PAGE_SIZE     0x0800U                                             /* 2 Kbytes pages
                                                                                            in additional
                                                                                            Extended USER area */
#define FLASH_EDATA_BANK_SIZE        (FLASH_EDATA_SIZE >> 1U)
#define FLASH_EDATA_PAGE_SIZE        0x0600U                                             /* 1.5 Kbytes pages
                                                                                            in additional
                                                                                            EDATA area */
#define FLASH_BANK_NB                (2U)                                                /* Number of
                                                                                             FLASH memory
                                                                                             banks */
#define FLASH_PAGE_NB                (FLASH_BANK_SIZE/FLASH_PAGE_SIZE)                   /* Number of
                                                                                             USER pages
                                                                                             per bank */
#define FLASH_EXT_USER_PAGE_NB       (FLASH_EXT_USER_BANK_SIZE/FLASH_EXT_USER_PAGE_SIZE) /* Number of
                                                                                             EDATA pages
                                                                                             per bank */
#define FLASH_EDATA_PAGE_NB          (FLASH_EDATA_BANK_SIZE/FLASH_EDATA_PAGE_SIZE)       /* Number of
                                                                                             Extended USER
                                                                                             pages per bank */
#define FLASH_WRP_GROUP_WIDTH        (1U)

