MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c531xx.h
/* **********************************  Bit definition for FLASH_ECCCORR register  *********************************** */
#define FLASH_ECCCORR_ADDR_ECC_Pos          (0U)
#define FLASH_ECCCORR_ADDR_ECC_Msk          (0xFFFFUL << FLASH_ECCCORR_ADDR_ECC_Pos)         /*!< 0x0000FFFF */
#define FLASH_ECCCORR_ADDR_ECC              FLASH_ECCCORR_ADDR_ECC_Msk                       /*!< ECC error address */
#define FLASH_ECCCORR_EDATA_ECC_Pos         (21U)
#define FLASH_ECCCORR_EDATA_ECC_Msk         (0x1UL << FLASH_ECCCORR_EDATA_ECC_Pos)           /*!< 0x00200000 */
#define FLASH_ECCCORR_EDATA_ECC             FLASH_ECCCORR_EDATA_ECC_Msk                      /*!< ECC fail for corrected
                                                                                                  ECC error in flash
                                                                                                  data area */
#define FLASH_ECCCORR_BK_ECC_Pos            (22U)
#define FLASH_ECCCORR_BK_ECC_Msk            (0x1UL << FLASH_ECCCORR_BK_ECC_Pos)              /*!< 0x00400000 */
#define FLASH_ECCCORR_BK_ECC                FLASH_ECCCORR_BK_ECC_Msk                         /*!< ECC bank flag for
                                                                                                  corrected ECC error */
#define FLASH_ECCCORR_SYSF_ECC_Pos          (23U)
#define FLASH_ECCCORR_SYSF_ECC_Msk          (0x1UL << FLASH_ECCCORR_SYSF_ECC_Pos)            /*!< 0x00800000 */
#define FLASH_ECCCORR_SYSF_ECC              FLASH_ECCCORR_SYSF_ECC_Msk                       /*!< ECC flag for corrected
                                                                                                  ECC error in system
                                                                                                  FLASH */
#define FLASH_ECCCORR_OTP_ECC_Pos           (24U)
#define FLASH_ECCCORR_OTP_ECC_Msk           (0x1UL << FLASH_ECCCORR_OTP_ECC_Pos)             /*!< 0x01000000 */
#define FLASH_ECCCORR_OTP_ECC               FLASH_ECCCORR_OTP_ECC_Msk                        /*!< OTP ECC error bit */
#define FLASH_ECCCORR_ECCCIE_Pos            (25U)
#define FLASH_ECCCORR_ECCCIE_Msk            (0x1UL << FLASH_ECCCORR_ECCCIE_Pos)              /*!< 0x02000000 */
#define FLASH_ECCCORR_ECCCIE                FLASH_ECCCORR_ECCCIE_Msk                         /*!< ECC single correction
                                                                                                  error interrupt enable
                                                                                                  bit When ECCCIE bit is
                                                                                                  set to 1, an interrupt
                                                                                                  is generated when an
                                                                                                  ECC single correction
                                                                                                  error occurs during a
                                                                                                  read operation. */
#define FLASH_ECCCORR_ECCC_Pos              (30U)
#define FLASH_ECCCORR_ECCC_Msk              (0x1UL << FLASH_ECCCORR_ECCC_Pos)                /*!< 0x40000000 */
#define FLASH_ECCCORR_ECCC                  FLASH_ECCCORR_ECCC_Msk                           /*!< ECC correction */

/* **********************************  Bit definition for FLASH_ECCDETR register  *********************************** */
#define FLASH_ECCDETR_ADDR_ECC_Pos          (0U)
#define FLASH_ECCDETR_ADDR_ECC_Msk          (0xFFFFUL << FLASH_ECCDETR_ADDR_ECC_Pos)         /*!< 0x0000FFFF */
#define FLASH_ECCDETR_ADDR_ECC              FLASH_ECCDETR_ADDR_ECC_Msk                       /*!< ECC error address */
#define FLASH_ECCDETR_EDATA_ECC_Pos         (21U)
#define FLASH_ECCDETR_EDATA_ECC_Msk         (0x1UL << FLASH_ECCDETR_EDATA_ECC_Pos)           /*!< 0x00200000 */
#define FLASH_ECCDETR_EDATA_ECC             FLASH_ECCDETR_EDATA_ECC_Msk                      /*!< ECC fail for double
                                                                                                  ECC error in flash
                                                                                                  data area */
#define FLASH_ECCDETR_BK_ECC_Pos            (22U)
#define FLASH_ECCDETR_BK_ECC_Msk            (0x1UL << FLASH_ECCDETR_BK_ECC_Pos)              /*!< 0x00400000 */
#define FLASH_ECCDETR_BK_ECC                FLASH_ECCDETR_BK_ECC_Msk                         /*!< ECC fail bank for
                                                                                                  double ECC Error */
#define FLASH_ECCDETR_SYSF_ECC_Pos          (23U)
#define FLASH_ECCDETR_SYSF_ECC_Msk          (0x1UL << FLASH_ECCDETR_SYSF_ECC_Pos)            /*!< 0x00800000 */
#define FLASH_ECCDETR_SYSF_ECC              FLASH_ECCDETR_SYSF_ECC_Msk                       /*!< ECC fail for double
                                                                                                  ECC error in system
                                                                                                  flash memory */
#define FLASH_ECCDETR_OTP_ECC_Pos           (24U)
#define FLASH_ECCDETR_OTP_ECC_Msk           (0x1UL << FLASH_ECCDETR_OTP_ECC_Pos)             /*!< 0x01000000 */
#define FLASH_ECCDETR_OTP_ECC               FLASH_ECCDETR_OTP_ECC_Msk                        /*!< OTP ECC error bit */
#define FLASH_ECCDETR_ECCD_Pos              (31U)
#define FLASH_ECCDETR_ECCD_Msk              (0x1UL << FLASH_ECCDETR_ECCD_Pos)                /*!< 0x80000000 */
#define FLASH_ECCDETR_ECCD                  FLASH_ECCDETR_ECCD_Msk                           /*!< ECC detection set by
                                                                                                  hardware when two ECC
                                                                                                  error has been
                                                                                                  detected. */

/* ***********************************  Bit definition for FLASH_ECCDR register  ************************************ */
#define FLASH_ECCDR_DATA_ECC_Pos            (0U)
#define FLASH_ECCDR_DATA_ECC_Msk            (0xFFFFUL << FLASH_ECCDR_DATA_ECC_Pos)           /*!< 0x0000FFFF */
#define FLASH_ECCDR_DATA_ECC                FLASH_ECCDR_DATA_ECC_Msk                         /*!< ECC error data */
#define FLASH_ECCDR_DATA_ADDR_ECC_Pos       (16U)
#define FLASH_ECCDR_DATA_ADDR_ECC_Msk       (0x7UL << FLASH_ECCDR_DATA_ADDR_ECC_Pos)         /*!< 0x00070000 */
#define FLASH_ECCDR_DATA_ADDR_ECC           FLASH_ECCDR_DATA_ADDR_ECC_Msk                    /*!< DATA ECC error address
                                                                                                  */

/* *********************************  Bit definition for FLASH_WRP2R_CUR register  ********************************** */
#define FLASH_WRP2R_CUR_WRPSG2_Pos          (0U)
#define FLASH_WRP2R_CUR_WRPSG2_Msk          (0xFFFFUL << FLASH_WRP2R_CUR_WRPSG2_Pos)         /*!< 0x0000FFFF */
#define FLASH_WRP2R_CUR_WRPSG2              FLASH_WRP2R_CUR_WRPSG2_Msk                       /*!< Bank2 page protection
                                                                                                  option status byte */

/* *********************************  Bit definition for FLASH_WRP2R_PRG register  ********************************** */
#define FLASH_WRP2R_PRG_WRPSG2_Pos          (0U)
#define FLASH_WRP2R_PRG_WRPSG2_Msk          (0xFFFFUL << FLASH_WRP2R_PRG_WRPSG2_Pos)         /*!< 0x0000FFFF */
#define FLASH_WRP2R_PRG_WRPSG2              FLASH_WRP2R_PRG_WRPSG2_Msk                       /*!< Bank2 page protection
                                                                                                  option status byte */

