MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c531xx.h
/* *********************************  Bit definition for FLASH_HDP2R_CUR register  ********************************** */
#define FLASH_HDP2R_CUR_HDP2_STRT_Pos       (0U)
#define FLASH_HDP2R_CUR_HDP2_STRT_Msk       (0xFUL << FLASH_HDP2R_CUR_HDP2_STRT_Pos)         /*!< 0x0000000F */
#define FLASH_HDP2R_CUR_HDP2_STRT           FLASH_HDP2R_CUR_HDP2_STRT_Msk                    /*!< Bank 2 HDPL barrier
                                                                                                  start set in number of
                                                                                                  8 Kbytes pages */
#define FLASH_HDP2R_CUR_HDP2_END_Pos        (16U)
#define FLASH_HDP2R_CUR_HDP2_END_Msk        (0xFUL << FLASH_HDP2R_CUR_HDP2_END_Pos)          /*!< 0x000F0000 */
#define FLASH_HDP2R_CUR_HDP2_END            FLASH_HDP2R_CUR_HDP2_END_Msk                     /*!< Bank 2 HDPL barrier
                                                                                                  end set in number of
                                                                                                  8 Kbytes pages */

/* *********************************  Bit definition for FLASH_HDP2R_PRG register  ********************************** */
#define FLASH_HDP2R_PRG_HDP2_STRT_Pos       (0U)
#define FLASH_HDP2R_PRG_HDP2_STRT_Msk       (0xFUL << FLASH_HDP2R_PRG_HDP2_STRT_Pos)         /*!< 0x0000000F */
#define FLASH_HDP2R_PRG_HDP2_STRT           FLASH_HDP2R_PRG_HDP2_STRT_Msk                    /*!< Bank 2 HDPL barrier
                                                                                                  start set in number of
                                                                                                  8 Kbytes pages */
#define FLASH_HDP2R_PRG_HDP2_END_Pos        (16U)
#define FLASH_HDP2R_PRG_HDP2_END_Msk        (0xFUL << FLASH_HDP2R_PRG_HDP2_END_Pos)          /*!< 0x000F0000 */
#define FLASH_HDP2R_PRG_HDP2_END            FLASH_HDP2R_PRG_HDP2_END_Msk                     /*!< Bank 2 HDPL barrier
                                                                                                  end set in number of
                                                                                                  8 Kbytes pages */

/**********************************************************************************************************************/
/*                                                                                                                    */
/*                                         General Purpose IOs (GPIO)                                                 */
/*                                                                                                                    */
/**********************************************************************************************************************/
/* ************************************  Bit definition for GPIO_MODER register  ************************************ */
#define GPIO_MODER_MODE0_Pos       (0U)
#define GPIO_MODER_MODE0_Msk       (0x3UL << GPIO_MODER_MODE0_Pos)        /*!< 0x00000003 */
#define GPIO_MODER_MODE0           GPIO_MODER_MODE0_Msk                   /*!< Port x configuration I/O pin y */
#define GPIO_MODER_MODE0_0         (0x1UL << GPIO_MODER_MODE0_Pos)        /*!< 0x00000001 */
#define GPIO_MODER_MODE0_1         (0x2UL << GPIO_MODER_MODE0_Pos)        /*!< 0x00000002 */
#define GPIO_MODER_MODE1_Pos       (2U)
#define GPIO_MODER_MODE1_Msk       (0x3UL << GPIO_MODER_MODE1_Pos)        /*!< 0x0000000C */
#define GPIO_MODER_MODE1           GPIO_MODER_MODE1_Msk                   /*!< Port x configuration I/O pin y */
#define GPIO_MODER_MODE1_0         (0x1UL << GPIO_MODER_MODE1_Pos)        /*!< 0x00000004 */
#define GPIO_MODER_MODE1_1         (0x2UL << GPIO_MODER_MODE1_Pos)        /*!< 0x00000008 */
#define GPIO_MODER_MODE2_Pos       (4U)
#define GPIO_MODER_MODE2_Msk       (0x3UL << GPIO_MODER_MODE2_Pos)        /*!< 0x00000030 */
#define GPIO_MODER_MODE2           GPIO_MODER_MODE2_Msk                   /*!< Port x configuration I/O pin y */
#define GPIO_MODER_MODE2_0         (0x1UL << GPIO_MODER_MODE2_Pos)        /*!< 0x00000010 */
#define GPIO_MODER_MODE2_1         (0x2UL << GPIO_MODER_MODE2_Pos)        /*!< 0x00000020 */
#define GPIO_MODER_MODE3_Pos       (6U)
#define GPIO_MODER_MODE3_Msk       (0x3UL << GPIO_MODER_MODE3_Pos)        /*!< 0x000000C0 */
#define GPIO_MODER_MODE3           GPIO_MODER_MODE3_Msk                   /*!< Port x configuration I/O pin y */
#define GPIO_MODER_MODE3_0         (0x1UL << GPIO_MODER_MODE3_Pos)        /*!< 0x00000040 */
#define GPIO_MODER_MODE3_1         (0x2UL << GPIO_MODER_MODE3_Pos)        /*!< 0x00000080 */
#define GPIO_MODER_MODE4_Pos       (8U)
#define GPIO_MODER_MODE4_Msk       (0x3UL << GPIO_MODER_MODE4_Pos)        /*!< 0x00000300 */
#define GPIO_MODER_MODE4           GPIO_MODER_MODE4_Msk                   /*!< Port x configuration I/O pin y */
#define GPIO_MODER_MODE4_0         (0x1UL << GPIO_MODER_MODE4_Pos)        /*!< 0x00000100 */
#define GPIO_MODER_MODE4_1         (0x2UL << GPIO_MODER_MODE4_Pos)        /*!< 0x00000200 */
#define GPIO_MODER_MODE5_Pos       (10U)
#define GPIO_MODER_MODE5_Msk       (0x3UL << GPIO_MODER_MODE5_Pos)        /*!< 0x00000C00 */
#define GPIO_MODER_MODE5           GPIO_MODER_MODE5_Msk                   /*!< Port x configuration I/O pin y */
#define GPIO_MODER_MODE5_0         (0x1UL << GPIO_MODER_MODE5_Pos)        /*!< 0x00000400 */
#define GPIO_MODER_MODE5_1         (0x2UL << GPIO_MODER_MODE5_Pos)        /*!< 0x00000800 */
#define GPIO_MODER_MODE6_Pos       (12U)
#define GPIO_MODER_MODE6_Msk       (0x3UL << GPIO_MODER_MODE6_Pos)        /*!< 0x00003000 */
#define GPIO_MODER_MODE6           GPIO_MODER_MODE6_Msk                   /*!< Port x configuration I/O pin y */
#define GPIO_MODER_MODE6_0         (0x1UL << GPIO_MODER_MODE6_Pos)        /*!< 0x00001000 */
#define GPIO_MODER_MODE6_1         (0x2UL << GPIO_MODER_MODE6_Pos)        /*!< 0x00002000 */
#define GPIO_MODER_MODE7_Pos       (14U)
#define GPIO_MODER_MODE7_Msk       (0x3UL << GPIO_MODER_MODE7_Pos)        /*!< 0x0000C000 */
#define GPIO_MODER_MODE7           GPIO_MODER_MODE7_Msk                   /*!< Port x configuration I/O pin y */
#define GPIO_MODER_MODE7_0         (0x1UL << GPIO_MODER_MODE7_Pos)        /*!< 0x00004000 */
#define GPIO_MODER_MODE7_1         (0x2UL << GPIO_MODER_MODE7_Pos)        /*!< 0x00008000 */
#define GPIO_MODER_MODE8_Pos       (16U)
#define GPIO_MODER_MODE8_Msk       (0x3UL << GPIO_MODER_MODE8_Pos)        /*!< 0x00030000 */
#define GPIO_MODER_MODE8           GPIO_MODER_MODE8_Msk                   /*!< Port x configuration I/O pin y */
#define GPIO_MODER_MODE8_0         (0x1UL << GPIO_MODER_MODE8_Pos)        /*!< 0x00010000 */
#define GPIO_MODER_MODE8_1         (0x2UL << GPIO_MODER_MODE8_Pos)        /*!< 0x00020000 */
#define GPIO_MODER_MODE9_Pos       (18U)
#define GPIO_MODER_MODE9_Msk       (0x3UL << GPIO_MODER_MODE9_Pos)        /*!< 0x000C0000 */
#define GPIO_MODER_MODE9           GPIO_MODER_MODE9_Msk                   /*!< Port x configuration I/O pin y */
#define GPIO_MODER_MODE9_0         (0x1UL << GPIO_MODER_MODE9_Pos)        /*!< 0x00040000 */
#define GPIO_MODER_MODE9_1         (0x2UL << GPIO_MODER_MODE9_Pos)        /*!< 0x00080000 */
#define GPIO_MODER_MODE10_Pos      (20U)
#define GPIO_MODER_MODE10_Msk      (0x3UL << GPIO_MODER_MODE10_Pos)       /*!< 0x00300000 */
#define GPIO_MODER_MODE10          GPIO_MODER_MODE10_Msk                  /*!< Port x configuration I/O pin y */
#define GPIO_MODER_MODE10_0        (0x1UL << GPIO_MODER_MODE10_Pos)       /*!< 0x00100000 */
#define GPIO_MODER_MODE10_1        (0x2UL << GPIO_MODER_MODE10_Pos)       /*!< 0x00200000 */
#define GPIO_MODER_MODE11_Pos      (22U)
#define GPIO_MODER_MODE11_Msk      (0x3UL << GPIO_MODER_MODE11_Pos)       /*!< 0x00C00000 */
#define GPIO_MODER_MODE11          GPIO_MODER_MODE11_Msk                  /*!< Port x configuration I/O pin y */
#define GPIO_MODER_MODE11_0        (0x1UL << GPIO_MODER_MODE11_Pos)       /*!< 0x00400000 */
#define GPIO_MODER_MODE11_1        (0x2UL << GPIO_MODER_MODE11_Pos)       /*!< 0x00800000 */
#define GPIO_MODER_MODE12_Pos      (24U)
#define GPIO_MODER_MODE12_Msk      (0x3UL << GPIO_MODER_MODE12_Pos)       /*!< 0x03000000 */
#define GPIO_MODER_MODE12          GPIO_MODER_MODE12_Msk                  /*!< Port x configuration I/O pin y */
#define GPIO_MODER_MODE12_0        (0x1UL << GPIO_MODER_MODE12_Pos)       /*!< 0x01000000 */
#define GPIO_MODER_MODE12_1        (0x2UL << GPIO_MODER_MODE12_Pos)       /*!< 0x02000000 */
#define GPIO_MODER_MODE13_Pos      (26U)
#define GPIO_MODER_MODE13_Msk      (0x3UL << GPIO_MODER_MODE13_Pos)       /*!< 0x0C000000 */
#define GPIO_MODER_MODE13          GPIO_MODER_MODE13_Msk                  /*!< Port x configuration I/O pin y */
#define GPIO_MODER_MODE13_0        (0x1UL << GPIO_MODER_MODE13_Pos)       /*!< 0x04000000 */
#define GPIO_MODER_MODE13_1        (0x2UL << GPIO_MODER_MODE13_Pos)       /*!< 0x08000000 */
#define GPIO_MODER_MODE14_Pos      (28U)
#define GPIO_MODER_MODE14_Msk      (0x3UL << GPIO_MODER_MODE14_Pos)       /*!< 0x30000000 */
#define GPIO_MODER_MODE14          GPIO_MODER_MODE14_Msk                  /*!< Port x configuration I/O pin y */
#define GPIO_MODER_MODE14_0        (0x1UL << GPIO_MODER_MODE14_Pos)       /*!< 0x10000000 */
#define GPIO_MODER_MODE14_1        (0x2UL << GPIO_MODER_MODE14_Pos)       /*!< 0x20000000 */
#define GPIO_MODER_MODE15_Pos      (30U)
#define GPIO_MODER_MODE15_Msk      (0x3UL << GPIO_MODER_MODE15_Pos)       /*!< 0xC0000000 */
#define GPIO_MODER_MODE15          GPIO_MODER_MODE15_Msk                  /*!< Port x configuration I/O pin y */
#define GPIO_MODER_MODE15_0        (0x1UL << GPIO_MODER_MODE15_Pos)       /*!< 0x40000000 */
#define GPIO_MODER_MODE15_1        (0x2UL << GPIO_MODER_MODE15_Pos)       /*!< 0x80000000 */

/* ***********************************  Bit definition for GPIO_OTYPER register  ************************************ */
#define GPIO_OTYPER_OT0_Pos        (0U)
#define GPIO_OTYPER_OT0_Msk        (0x1UL << GPIO_OTYPER_OT0_Pos)         /*!< 0x00000001 */
#define GPIO_OTYPER_OT0            GPIO_OTYPER_OT0_Msk                    /*!< Port x configuration I/O pin y */
#define GPIO_OTYPER_OT1_Pos        (1U)
#define GPIO_OTYPER_OT1_Msk        (0x1UL << GPIO_OTYPER_OT1_Pos)         /*!< 0x00000002 */
#define GPIO_OTYPER_OT1            GPIO_OTYPER_OT1_Msk                    /*!< Port x configuration I/O pin y */
#define GPIO_OTYPER_OT2_Pos        (2U)
#define GPIO_OTYPER_OT2_Msk        (0x1UL << GPIO_OTYPER_OT2_Pos)         /*!< 0x00000004 */
#define GPIO_OTYPER_OT2            GPIO_OTYPER_OT2_Msk                    /*!< Port x configuration I/O pin y */
#define GPIO_OTYPER_OT3_Pos        (3U)
#define GPIO_OTYPER_OT3_Msk        (0x1UL << GPIO_OTYPER_OT3_Pos)         /*!< 0x00000008 */
#define GPIO_OTYPER_OT3            GPIO_OTYPER_OT3_Msk                    /*!< Port x configuration I/O pin y */
#define GPIO_OTYPER_OT4_Pos        (4U)
#define GPIO_OTYPER_OT4_Msk        (0x1UL << GPIO_OTYPER_OT4_Pos)         /*!< 0x00000010 */
#define GPIO_OTYPER_OT4            GPIO_OTYPER_OT4_Msk                    /*!< Port x configuration I/O pin y */
#define GPIO_OTYPER_OT5_Pos        (5U)
#define GPIO_OTYPER_OT5_Msk        (0x1UL << GPIO_OTYPER_OT5_Pos)         /*!< 0x00000020 */
#define GPIO_OTYPER_OT5            GPIO_OTYPER_OT5_Msk                    /*!< Port x configuration I/O pin y */
#define GPIO_OTYPER_OT6_Pos        (6U)
#define GPIO_OTYPER_OT6_Msk        (0x1UL << GPIO_OTYPER_OT6_Pos)         /*!< 0x00000040 */
#define GPIO_OTYPER_OT6            GPIO_OTYPER_OT6_Msk                    /*!< Port x configuration I/O pin y */
#define GPIO_OTYPER_OT7_Pos        (7U)
#define GPIO_OTYPER_OT7_Msk        (0x1UL << GPIO_OTYPER_OT7_Pos)         /*!< 0x00000080 */
#define GPIO_OTYPER_OT7            GPIO_OTYPER_OT7_Msk                    /*!< Port x configuration I/O pin y */
#define GPIO_OTYPER_OT8_Pos        (8U)
#define GPIO_OTYPER_OT8_Msk        (0x1UL << GPIO_OTYPER_OT8_Pos)         /*!< 0x00000100 */
#define GPIO_OTYPER_OT8            GPIO_OTYPER_OT8_Msk                    /*!< Port x configuration I/O pin y */
#define GPIO_OTYPER_OT9_Pos        (9U)
#define GPIO_OTYPER_OT9_Msk        (0x1UL << GPIO_OTYPER_OT9_Pos)         /*!< 0x00000200 */
#define GPIO_OTYPER_OT9            GPIO_OTYPER_OT9_Msk                    /*!< Port x configuration I/O pin y */
#define GPIO_OTYPER_OT10_Pos       (10U)
#define GPIO_OTYPER_OT10_Msk       (0x1UL << GPIO_OTYPER_OT10_Pos)        /*!< 0x00000400 */
#define GPIO_OTYPER_OT10           GPIO_OTYPER_OT10_Msk                   /*!< Port x configuration I/O pin y */
#define GPIO_OTYPER_OT11_Pos       (11U)
#define GPIO_OTYPER_OT11_Msk       (0x1UL << GPIO_OTYPER_OT11_Pos)        /*!< 0x00000800 */
#define GPIO_OTYPER_OT11           GPIO_OTYPER_OT11_Msk                   /*!< Port x configuration I/O pin y */
#define GPIO_OTYPER_OT12_Pos       (12U)
#define GPIO_OTYPER_OT12_Msk       (0x1UL << GPIO_OTYPER_OT12_Pos)        /*!< 0x00001000 */
#define GPIO_OTYPER_OT12           GPIO_OTYPER_OT12_Msk                   /*!< Port x configuration I/O pin y */
#define GPIO_OTYPER_OT13_Pos       (13U)
#define GPIO_OTYPER_OT13_Msk       (0x1UL << GPIO_OTYPER_OT13_Pos)        /*!< 0x00002000 */
#define GPIO_OTYPER_OT13           GPIO_OTYPER_OT13_Msk                   /*!< Port x configuration I/O pin y */
#define GPIO_OTYPER_OT14_Pos       (14U)
#define GPIO_OTYPER_OT14_Msk       (0x1UL << GPIO_OTYPER_OT14_Pos)        /*!< 0x00004000 */
#define GPIO_OTYPER_OT14           GPIO_OTYPER_OT14_Msk                   /*!< Port x configuration I/O pin y */
#define GPIO_OTYPER_OT15_Pos       (15U)
#define GPIO_OTYPER_OT15_Msk       (0x1UL << GPIO_OTYPER_OT15_Pos)        /*!< 0x00008000 */
#define GPIO_OTYPER_OT15           GPIO_OTYPER_OT15_Msk                   /*!< Port x configuration I/O pin y */

/* ***********************************  Bit definition for GPIO_OSPEEDR register  *********************************** */
#define GPIO_OSPEEDR_OSPEED0_Pos   (0U)
#define GPIO_OSPEEDR_OSPEED0_Msk   (0x3UL << GPIO_OSPEEDR_OSPEED0_Pos)   /*!< 0x00000003 */
#define GPIO_OSPEEDR_OSPEED0       GPIO_OSPEEDR_OSPEED0_Msk              /*!< Port x configuration I/O pin y */
#define GPIO_OSPEEDR_OSPEED0_0     (0x1UL << GPIO_OSPEEDR_OSPEED0_Pos)   /*!< 0x00000001 */
#define GPIO_OSPEEDR_OSPEED0_1     (0x2UL << GPIO_OSPEEDR_OSPEED0_Pos)   /*!< 0x00000002 */
#define GPIO_OSPEEDR_OSPEED1_Pos   (2U)
#define GPIO_OSPEEDR_OSPEED1_Msk   (0x3UL << GPIO_OSPEEDR_OSPEED1_Pos)   /*!< 0x0000000C */
#define GPIO_OSPEEDR_OSPEED1       GPIO_OSPEEDR_OSPEED1_Msk              /*!< Port x configuration I/O pin y */
#define GPIO_OSPEEDR_OSPEED1_0     (0x1UL << GPIO_OSPEEDR_OSPEED1_Pos)   /*!< 0x00000004 */
#define GPIO_OSPEEDR_OSPEED1_1     (0x2UL << GPIO_OSPEEDR_OSPEED1_Pos)   /*!< 0x00000008 */
#define GPIO_OSPEEDR_OSPEED2_Pos   (4U)
#define GPIO_OSPEEDR_OSPEED2_Msk   (0x3UL << GPIO_OSPEEDR_OSPEED2_Pos)   /*!< 0x00000030 */
#define GPIO_OSPEEDR_OSPEED2       GPIO_OSPEEDR_OSPEED2_Msk              /*!< Port x configuration I/O pin y */
#define GPIO_OSPEEDR_OSPEED2_0     (0x1UL << GPIO_OSPEEDR_OSPEED2_Pos)   /*!< 0x00000010 */
#define GPIO_OSPEEDR_OSPEED2_1     (0x2UL << GPIO_OSPEEDR_OSPEED2_Pos)   /*!< 0x00000020 */
#define GPIO_OSPEEDR_OSPEED3_Pos   (6U)
#define GPIO_OSPEEDR_OSPEED3_Msk   (0x3UL << GPIO_OSPEEDR_OSPEED3_Pos)   /*!< 0x000000C0 */
#define GPIO_OSPEEDR_OSPEED3       GPIO_OSPEEDR_OSPEED3_Msk              /*!< Port x configuration I/O pin y */
#define GPIO_OSPEEDR_OSPEED3_0     (0x1UL << GPIO_OSPEEDR_OSPEED3_Pos)   /*!< 0x00000040 */
#define GPIO_OSPEEDR_OSPEED3_1     (0x2UL << GPIO_OSPEEDR_OSPEED3_Pos)   /*!< 0x00000080 */
#define GPIO_OSPEEDR_OSPEED4_Pos   (8U)
#define GPIO_OSPEEDR_OSPEED4_Msk   (0x3UL << GPIO_OSPEEDR_OSPEED4_Pos)   /*!< 0x00000300 */
#define GPIO_OSPEEDR_OSPEED4       GPIO_OSPEEDR_OSPEED4_Msk              /*!< Port x configuration I/O pin y */
#define GPIO_OSPEEDR_OSPEED4_0     (0x1UL << GPIO_OSPEEDR_OSPEED4_Pos)   /*!< 0x00000100 */
#define GPIO_OSPEEDR_OSPEED4_1     (0x2UL << GPIO_OSPEEDR_OSPEED4_Pos)   /*!< 0x00000200 */
#define GPIO_OSPEEDR_OSPEED5_Pos   (10U)
#define GPIO_OSPEEDR_OSPEED5_Msk   (0x3UL << GPIO_OSPEEDR_OSPEED5_Pos)   /*!< 0x00000C00 */
#define GPIO_OSPEEDR_OSPEED5       GPIO_OSPEEDR_OSPEED5_Msk              /*!< Port x configuration I/O pin y */
#define GPIO_OSPEEDR_OSPEED5_0     (0x1UL << GPIO_OSPEEDR_OSPEED5_Pos)   /*!< 0x00000400 */
#define GPIO_OSPEEDR_OSPEED5_1     (0x2UL << GPIO_OSPEEDR_OSPEED5_Pos)   /*!< 0x00000800 */
#define GPIO_OSPEEDR_OSPEED6_Pos   (12U)
#define GPIO_OSPEEDR_OSPEED6_Msk   (0x3UL << GPIO_OSPEEDR_OSPEED6_Pos)   /*!< 0x00003000 */
#define GPIO_OSPEEDR_OSPEED6       GPIO_OSPEEDR_OSPEED6_Msk              /*!< Port x configuration I/O pin y */
#define GPIO_OSPEEDR_OSPEED6_0     (0x1UL << GPIO_OSPEEDR_OSPEED6_Pos)   /*!< 0x00001000 */
#define GPIO_OSPEEDR_OSPEED6_1     (0x2UL << GPIO_OSPEEDR_OSPEED6_Pos)   /*!< 0x00002000 */
#define GPIO_OSPEEDR_OSPEED7_Pos   (14U)
#define GPIO_OSPEEDR_OSPEED7_Msk   (0x3UL << GPIO_OSPEEDR_OSPEED7_Pos)   /*!< 0x0000C000 */
#define GPIO_OSPEEDR_OSPEED7       GPIO_OSPEEDR_OSPEED7_Msk              /*!< Port x configuration I/O pin y */
#define GPIO_OSPEEDR_OSPEED7_0     (0x1UL << GPIO_OSPEEDR_OSPEED7_Pos)   /*!< 0x00004000 */
#define GPIO_OSPEEDR_OSPEED7_1     (0x2UL << GPIO_OSPEEDR_OSPEED7_Pos)   /*!< 0x00008000 */
#define GPIO_OSPEEDR_OSPEED8_Pos   (16U)
#define GPIO_OSPEEDR_OSPEED8_Msk   (0x3UL << GPIO_OSPEEDR_OSPEED8_Pos)   /*!< 0x00030000 */
#define GPIO_OSPEEDR_OSPEED8       GPIO_OSPEEDR_OSPEED8_Msk              /*!< Port x configuration I/O pin y */
#define GPIO_OSPEEDR_OSPEED8_0     (0x1UL << GPIO_OSPEEDR_OSPEED8_Pos)   /*!< 0x00010000 */
#define GPIO_OSPEEDR_OSPEED8_1     (0x2UL << GPIO_OSPEEDR_OSPEED8_Pos)   /*!< 0x00020000 */
#define GPIO_OSPEEDR_OSPEED9_Pos   (18U)
#define GPIO_OSPEEDR_OSPEED9_Msk   (0x3UL << GPIO_OSPEEDR_OSPEED9_Pos)   /*!< 0x000C0000 */
#define GPIO_OSPEEDR_OSPEED9       GPIO_OSPEEDR_OSPEED9_Msk              /*!< Port x configuration I/O pin y */
#define GPIO_OSPEEDR_OSPEED9_0     (0x1UL << GPIO_OSPEEDR_OSPEED9_Pos)   /*!< 0x00040000 */
#define GPIO_OSPEEDR_OSPEED9_1     (0x2UL << GPIO_OSPEEDR_OSPEED9_Pos)   /*!< 0x00080000 */
#define GPIO_OSPEEDR_OSPEED10_Pos  (20U)
#define GPIO_OSPEEDR_OSPEED10_Msk  (0x3UL << GPIO_OSPEEDR_OSPEED10_Pos)  /*!< 0x00300000 */
#define GPIO_OSPEEDR_OSPEED10      GPIO_OSPEEDR_OSPEED10_Msk             /*!< Port x configuration I/O pin y */
#define GPIO_OSPEEDR_OSPEED10_0    (0x1UL << GPIO_OSPEEDR_OSPEED10_Pos)  /*!< 0x00100000 */
#define GPIO_OSPEEDR_OSPEED10_1    (0x2UL << GPIO_OSPEEDR_OSPEED10_Pos)  /*!< 0x00200000 */
#define GPIO_OSPEEDR_OSPEED11_Pos  (22U)
#define GPIO_OSPEEDR_OSPEED11_Msk  (0x3UL << GPIO_OSPEEDR_OSPEED11_Pos)  /*!< 0x00C00000 */
#define GPIO_OSPEEDR_OSPEED11      GPIO_OSPEEDR_OSPEED11_Msk             /*!< Port x configuration I/O pin y */
#define GPIO_OSPEEDR_OSPEED11_0    (0x1UL << GPIO_OSPEEDR_OSPEED11_Pos)  /*!< 0x00400000 */
#define GPIO_OSPEEDR_OSPEED11_1    (0x2UL << GPIO_OSPEEDR_OSPEED11_Pos)  /*!< 0x00800000 */
#define GPIO_OSPEEDR_OSPEED12_Pos  (24U)
#define GPIO_OSPEEDR_OSPEED12_Msk  (0x3UL << GPIO_OSPEEDR_OSPEED12_Pos)  /*!< 0x03000000 */
#define GPIO_OSPEEDR_OSPEED12      GPIO_OSPEEDR_OSPEED12_Msk             /*!< Port x configuration I/O pin y */
#define GPIO_OSPEEDR_OSPEED12_0    (0x1UL << GPIO_OSPEEDR_OSPEED12_Pos)  /*!< 0x01000000 */
#define GPIO_OSPEEDR_OSPEED12_1    (0x2UL << GPIO_OSPEEDR_OSPEED12_Pos)  /*!< 0x02000000 */
#define GPIO_OSPEEDR_OSPEED13_Pos  (26U)
#define GPIO_OSPEEDR_OSPEED13_Msk  (0x3UL << GPIO_OSPEEDR_OSPEED13_Pos)  /*!< 0x0C000000 */
#define GPIO_OSPEEDR_OSPEED13      GPIO_OSPEEDR_OSPEED13_Msk             /*!< Port x configuration I/O pin y */
#define GPIO_OSPEEDR_OSPEED13_0    (0x1UL << GPIO_OSPEEDR_OSPEED13_Pos)  /*!< 0x04000000 */
#define GPIO_OSPEEDR_OSPEED13_1    (0x2UL << GPIO_OSPEEDR_OSPEED13_Pos)  /*!< 0x08000000 */
#define GPIO_OSPEEDR_OSPEED14_Pos  (28U)
#define GPIO_OSPEEDR_OSPEED14_Msk  (0x3UL << GPIO_OSPEEDR_OSPEED14_Pos)  /*!< 0x30000000 */
#define GPIO_OSPEEDR_OSPEED14      GPIO_OSPEEDR_OSPEED14_Msk             /*!< Port x configuration I/O pin y */
#define GPIO_OSPEEDR_OSPEED14_0    (0x1UL << GPIO_OSPEEDR_OSPEED14_Pos)  /*!< 0x10000000 */
#define GPIO_OSPEEDR_OSPEED14_1    (0x2UL << GPIO_OSPEEDR_OSPEED14_Pos)  /*!< 0x20000000 */
#define GPIO_OSPEEDR_OSPEED15_Pos  (30U)
#define GPIO_OSPEEDR_OSPEED15_Msk  (0x3UL << GPIO_OSPEEDR_OSPEED15_Pos)  /*!< 0xC0000000 */
#define GPIO_OSPEEDR_OSPEED15      GPIO_OSPEEDR_OSPEED15_Msk             /*!< Port x configuration I/O pin y */
#define GPIO_OSPEEDR_OSPEED15_0    (0x1UL << GPIO_OSPEEDR_OSPEED15_Pos)  /*!< 0x40000000 */
#define GPIO_OSPEEDR_OSPEED15_1    (0x2UL << GPIO_OSPEEDR_OSPEED15_Pos)  /*!< 0x80000000 */

