MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c531xx.h
/* *************************************  Bit definition for HASH_STR register  ************************************* */
#define HASH_STR_NBLW_Pos    (0U)
#define HASH_STR_NBLW_Msk    (0x1FUL << HASH_STR_NBLW_Pos)     /*!< 0x0000001F */
#define HASH_STR_NBLW        HASH_STR_NBLW_Msk                 /*!< Number of valid bits in the last word */
#define HASH_STR_NBLW_0      (0x1UL << HASH_STR_NBLW_Pos)      /*!< 0x00000001 */
#define HASH_STR_NBLW_1      (0x2UL << HASH_STR_NBLW_Pos)      /*!< 0x00000002 */
#define HASH_STR_NBLW_2      (0x4UL << HASH_STR_NBLW_Pos)      /*!< 0x00000004 */
#define HASH_STR_NBLW_3      (0x8UL << HASH_STR_NBLW_Pos)      /*!< 0x00000008 */
#define HASH_STR_NBLW_4      (0x10UL << HASH_STR_NBLW_Pos)     /*!< 0x00000010 */
#define HASH_STR_DCAL_Pos    (8U)
#define HASH_STR_DCAL_Msk    (0x1UL << HASH_STR_DCAL_Pos)      /*!< 0x00000100 */
#define HASH_STR_DCAL        HASH_STR_DCAL_Msk                 /*!< Digest calculation */

/* *************************************  Bit definition for HASH_IMR register  ************************************* */
#define HASH_IMR_DINIE_Pos   (0U)
#define HASH_IMR_DINIE_Msk   (0x1UL << HASH_IMR_DINIE_Pos)     /*!< 0x00000001 */
#define HASH_IMR_DINIE       HASH_IMR_DINIE_Msk                /*!< Data input interrupt enable */
#define HASH_IMR_DCIE_Pos    (1U)
#define HASH_IMR_DCIE_Msk    (0x1UL << HASH_IMR_DCIE_Pos)      /*!< 0x00000002 */
#define HASH_IMR_DCIE        HASH_IMR_DCIE_Msk                 /*!< Digest calculation completion interrupt enable */

/* *************************************  Bit definition for HASH_SR register  ************************************** */
#define HASH_SR_DINIS_Pos    (0U)
#define HASH_SR_DINIS_Msk    (0x1UL << HASH_SR_DINIS_Pos)      /*!< 0x00000001 */
#define HASH_SR_DINIS        HASH_SR_DINIS_Msk                 /*!< Data input interrupt status */
#define HASH_SR_DCIS_Pos     (1U)
#define HASH_SR_DCIS_Msk     (0x1UL << HASH_SR_DCIS_Pos)       /*!< 0x00000002 */
#define HASH_SR_DCIS         HASH_SR_DCIS_Msk                  /*!< Digest calculation completion interrupt status */
#define HASH_SR_DMAS_Pos     (2U)
#define HASH_SR_DMAS_Msk     (0x1UL << HASH_SR_DMAS_Pos)       /*!< 0x00000004 */
#define HASH_SR_DMAS         HASH_SR_DMAS_Msk                  /*!< DMA Status */
#define HASH_SR_BUSY_Pos     (3U)
#define HASH_SR_BUSY_Msk     (0x1UL << HASH_SR_BUSY_Pos)       /*!< 0x00000008 */
#define HASH_SR_BUSY         HASH_SR_BUSY_Msk                  /*!< Busy bit */
#define HASH_SR_NBWP_Pos     (9U)
#define HASH_SR_NBWP_Msk     (0x1FUL << HASH_SR_NBWP_Pos)      /*!< 0x00003E00 */
#define HASH_SR_NBWP         HASH_SR_NBWP_Msk                  /*!< Number of words already pushed */
#define HASH_SR_NBWP_0       (0x1UL << HASH_SR_NBWP_Pos)       /*!< 0x00000200 */
#define HASH_SR_NBWP_1       (0x2UL << HASH_SR_NBWP_Pos)       /*!< 0x00000400 */
#define HASH_SR_NBWP_2       (0x4UL << HASH_SR_NBWP_Pos)       /*!< 0x00000800 */
#define HASH_SR_NBWP_3       (0x8UL << HASH_SR_NBWP_Pos)       /*!< 0x00001000 */
#define HASH_SR_NBWP_4       (0x10UL << HASH_SR_NBWP_Pos)      /*!< 0x00002000 */
#define HASH_SR_DINNE_Pos    (15U)
#define HASH_SR_DINNE_Msk    (0x1UL << HASH_SR_DINNE_Pos)      /*!< 0x00008000 */
#define HASH_SR_DINNE        HASH_SR_DINNE_Msk                 /*!< DIN not empty */
#define HASH_SR_NBWE_Pos     (16U)
#define HASH_SR_NBWE_Msk     (0x1FUL << HASH_SR_NBWE_Pos)      /*!< 0x001F0000 */
#define HASH_SR_NBWE         HASH_SR_NBWE_Msk                  /*!< Number of words expected */
#define HASH_SR_NBWE_0       (0x1UL << HASH_SR_NBWE_Pos)       /*!< 0x00010000 */
#define HASH_SR_NBWE_1       (0x2UL << HASH_SR_NBWE_Pos)       /*!< 0x00020000 */
#define HASH_SR_NBWE_2       (0x4UL << HASH_SR_NBWE_Pos)       /*!< 0x00040000 */
#define HASH_SR_NBWE_3       (0x8UL << HASH_SR_NBWE_Pos)       /*!< 0x00080000 */
#define HASH_SR_NBWE_4       (0x10UL << HASH_SR_NBWE_Pos)      /*!< 0x00100000 */

/* *************************************  Bit definition for HASH_CSR register  ************************************* */
#define HASH_CSR_CS_Pos     (0U)
#define HASH_CSR_CS_Msk     (0xFFFFFFFFUL << HASH_CSR_CS_Pos)  /*!< 0xFFFFFFFF */
#define HASH_CSR_CS         HASH_CSR_CS_Msk                    /*!< Context swap x */

/* *************************************  Bit definition for HASH_HR register  ************************************** */
#define HASH_HR_H_Pos       (0U)
#define HASH_HR_H_Msk       (0xFFFFFFFFUL << HASH_HR_H_Pos)    /*!< 0xFFFFFFFF */
#define HASH_HR_H           HASH_HR_H_Msk                      /*!< Hash data x */

/******************************************************************************/
/*                                                                            */
/*                  Inter-integrated Circuit Interface (I2C)                  */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for I2C_CR1 register  *******************/
#define I2C_CR1_PE_Pos                      (0U)
#define I2C_CR1_PE_Msk                      (0x1UL << I2C_CR1_PE_Pos)               /*!< 0x00000001 */
#define I2C_CR1_PE                          I2C_CR1_PE_Msk                          /*!< Peripheral enable */
#define I2C_CR1_TXIE_Pos                    (1U)
#define I2C_CR1_TXIE_Msk                    (0x1UL << I2C_CR1_TXIE_Pos)             /*!< 0x00000002 */
#define I2C_CR1_TXIE                        I2C_CR1_TXIE_Msk                        /*!< TX interrupt enable */
#define I2C_CR1_RXIE_Pos                    (2U)
#define I2C_CR1_RXIE_Msk                    (0x1UL << I2C_CR1_RXIE_Pos)             /*!< 0x00000004 */
#define I2C_CR1_RXIE                        I2C_CR1_RXIE_Msk                        /*!< RX interrupt enable */
#define I2C_CR1_ADDRIE_Pos                  (3U)
#define I2C_CR1_ADDRIE_Msk                  (0x1UL << I2C_CR1_ADDRIE_Pos)           /*!< 0x00000008 */
#define I2C_CR1_ADDRIE                      I2C_CR1_ADDRIE_Msk                      /*!< Address match interrupt enable */
#define I2C_CR1_NACKIE_Pos                  (4U)
#define I2C_CR1_NACKIE_Msk                  (0x1UL << I2C_CR1_NACKIE_Pos)           /*!< 0x00000010 */
#define I2C_CR1_NACKIE                      I2C_CR1_NACKIE_Msk                      /*!< NACK received interrupt enable */
#define I2C_CR1_STOPIE_Pos                  (5U)
#define I2C_CR1_STOPIE_Msk                  (0x1UL << I2C_CR1_STOPIE_Pos)           /*!< 0x00000020 */
#define I2C_CR1_STOPIE                      I2C_CR1_STOPIE_Msk                      /*!< STOP detection interrupt enable */
#define I2C_CR1_TCIE_Pos                    (6U)
#define I2C_CR1_TCIE_Msk                    (0x1UL << I2C_CR1_TCIE_Pos)             /*!< 0x00000040 */
#define I2C_CR1_TCIE                        I2C_CR1_TCIE_Msk                        /*!< Transfer complete interrupt enable */
#define I2C_CR1_ERRIE_Pos                   (7U)
#define I2C_CR1_ERRIE_Msk                   (0x1UL << I2C_CR1_ERRIE_Pos)            /*!< 0x00000080 */
#define I2C_CR1_ERRIE                       I2C_CR1_ERRIE_Msk                       /*!< Errors interrupt enable */
#define I2C_CR1_DNF_Pos                     (8U)
#define I2C_CR1_DNF_Msk                     (0xFUL << I2C_CR1_DNF_Pos)              /*!< 0x00000F00 */
#define I2C_CR1_DNF                         I2C_CR1_DNF_Msk                         /*!< Digital noise filter */
#define I2C_CR1_ANFOFF_Pos                  (12U)
#define I2C_CR1_ANFOFF_Msk                  (0x1UL << I2C_CR1_ANFOFF_Pos)           /*!< 0x00001000 */
#define I2C_CR1_ANFOFF                      I2C_CR1_ANFOFF_Msk                      /*!< Analog noise filter OFF */
#define I2C_CR1_TXDMAEN_Pos                 (14U)
#define I2C_CR1_TXDMAEN_Msk                 (0x1UL << I2C_CR1_TXDMAEN_Pos)          /*!< 0x00004000 */
#define I2C_CR1_TXDMAEN                     I2C_CR1_TXDMAEN_Msk                     /*!< DMA transmission requests enable */
#define I2C_CR1_RXDMAEN_Pos                 (15U)
#define I2C_CR1_RXDMAEN_Msk                 (0x1UL << I2C_CR1_RXDMAEN_Pos)          /*!< 0x00008000 */
#define I2C_CR1_RXDMAEN                     I2C_CR1_RXDMAEN_Msk                     /*!< DMA reception requests enable */
#define I2C_CR1_SBC_Pos                     (16U)
#define I2C_CR1_SBC_Msk                     (0x1UL << I2C_CR1_SBC_Pos)              /*!< 0x00010000 */
#define I2C_CR1_SBC                         I2C_CR1_SBC_Msk                         /*!< Slave byte control */
#define I2C_CR1_NOSTRETCH_Pos               (17U)
#define I2C_CR1_NOSTRETCH_Msk               (0x1UL << I2C_CR1_NOSTRETCH_Pos)        /*!< 0x00020000 */
#define I2C_CR1_NOSTRETCH                   I2C_CR1_NOSTRETCH_Msk                   /*!< Clock stretching disable */
#define I2C_CR1_WUPEN_Pos                   (18U)
#define I2C_CR1_WUPEN_Msk                   (0x1UL << I2C_CR1_WUPEN_Pos)            /*!< 0x00040000 */
#define I2C_CR1_WUPEN                       I2C_CR1_WUPEN_Msk                       /*!< Wakeup from STOP enable */
#define I2C_CR1_GCEN_Pos                    (19U)
#define I2C_CR1_GCEN_Msk                    (0x1UL << I2C_CR1_GCEN_Pos)             /*!< 0x00080000 */
#define I2C_CR1_GCEN                        I2C_CR1_GCEN_Msk                        /*!< General call enable */
#define I2C_CR1_SMBHEN_Pos                  (20U)
#define I2C_CR1_SMBHEN_Msk                  (0x1UL << I2C_CR1_SMBHEN_Pos)           /*!< 0x00100000 */
#define I2C_CR1_SMBHEN                      I2C_CR1_SMBHEN_Msk                      /*!< SMBus host address enable */
#define I2C_CR1_SMBDEN_Pos                  (21U)
#define I2C_CR1_SMBDEN_Msk                  (0x1UL << I2C_CR1_SMBDEN_Pos)           /*!< 0x00200000 */
#define I2C_CR1_SMBDEN                      I2C_CR1_SMBDEN_Msk                      /*!< SMBus device default address enable */
#define I2C_CR1_ALERTEN_Pos                 (22U)
#define I2C_CR1_ALERTEN_Msk                 (0x1UL << I2C_CR1_ALERTEN_Pos)          /*!< 0x00400000 */
#define I2C_CR1_ALERTEN                     I2C_CR1_ALERTEN_Msk                     /*!< SMBus alert enable */
#define I2C_CR1_PECEN_Pos                   (23U)
#define I2C_CR1_PECEN_Msk                   (0x1UL << I2C_CR1_PECEN_Pos)            /*!< 0x00800000 */
#define I2C_CR1_PECEN                       I2C_CR1_PECEN_Msk                       /*!< PEC enable */
#define I2C_CR1_FMP_Pos                     (24U)
#define I2C_CR1_FMP_Msk                     (0x1UL << I2C_CR1_FMP_Pos)            /*!< 0x01000000 */
#define I2C_CR1_FMP                         I2C_CR1_FMP_Msk                       /*!< Fast-mode Plus 20 mA drive enable */
#define I2C_CR1_ADDRACLR_Pos                (30U)
#define I2C_CR1_ADDRACLR_Msk                (0x1UL << I2C_CR1_ADDRACLR_Pos)         /*!< 0x40000000 */
#define I2C_CR1_ADDRACLR                    I2C_CR1_ADDRACLR_Msk                    /*!< ADDRACLR enable */
#define I2C_CR1_STOPFACLR_Pos               (31U)
#define I2C_CR1_STOPFACLR_Msk               (0x1UL << I2C_CR1_STOPFACLR_Pos)        /*!< 0x80000000 */
#define I2C_CR1_STOPFACLR                   I2C_CR1_STOPFACLR_Msk                   /*!< STOPFACLR enable */

/******************  Bit definition for I2C_CR2 register  ********************/
#define I2C_CR2_SADD_Pos                    (0U)
#define I2C_CR2_SADD_Msk                    (0x3FFUL << I2C_CR2_SADD_Pos)           /*!< 0x000003FF */
#define I2C_CR2_SADD                        I2C_CR2_SADD_Msk                        /*!< Slave address (master mode) */
#define I2C_CR2_RD_WRN_Pos                  (10U)
#define I2C_CR2_RD_WRN_Msk                  (0x1UL << I2C_CR2_RD_WRN_Pos)           /*!< 0x00000400 */
#define I2C_CR2_RD_WRN                      I2C_CR2_RD_WRN_Msk                      /*!< Transfer direction (master mode) */
#define I2C_CR2_ADD10_Pos                   (11U)
#define I2C_CR2_ADD10_Msk                   (0x1UL << I2C_CR2_ADD10_Pos)            /*!< 0x00000800 */
#define I2C_CR2_ADD10                       I2C_CR2_ADD10_Msk                       /*!< 10-bit addressing mode (master mode) */
#define I2C_CR2_HEAD10R_Pos                 (12U)
#define I2C_CR2_HEAD10R_Msk                 (0x1UL << I2C_CR2_HEAD10R_Pos)          /*!< 0x00001000 */
#define I2C_CR2_HEAD10R                     I2C_CR2_HEAD10R_Msk                     /*!< 10-bit address header only read direction (master mode) */
#define I2C_CR2_START_Pos                   (13U)
#define I2C_CR2_START_Msk                   (0x1UL << I2C_CR2_START_Pos)            /*!< 0x00002000 */
#define I2C_CR2_START                       I2C_CR2_START_Msk                       /*!< START generation */
#define I2C_CR2_STOP_Pos                    (14U)
#define I2C_CR2_STOP_Msk                    (0x1UL << I2C_CR2_STOP_Pos)             /*!< 0x00004000 */
#define I2C_CR2_STOP                        I2C_CR2_STOP_Msk                        /*!< STOP generation (master mode) */
#define I2C_CR2_NACK_Pos                    (15U)
#define I2C_CR2_NACK_Msk                    (0x1UL << I2C_CR2_NACK_Pos)             /*!< 0x00008000 */
#define I2C_CR2_NACK                        I2C_CR2_NACK_Msk                        /*!< NACK generation (slave mode) */
#define I2C_CR2_NBYTES_Pos                  (16U)
#define I2C_CR2_NBYTES_Msk                  (0xFFUL << I2C_CR2_NBYTES_Pos)          /*!< 0x00FF0000 */
#define I2C_CR2_NBYTES                      I2C_CR2_NBYTES_Msk                      /*!< Number of bytes */
#define I2C_CR2_RELOAD_Pos                  (24U)
#define I2C_CR2_RELOAD_Msk                  (0x1UL << I2C_CR2_RELOAD_Pos)           /*!< 0x01000000 */
#define I2C_CR2_RELOAD                      I2C_CR2_RELOAD_Msk                      /*!< NBYTES reload mode */
#define I2C_CR2_AUTOEND_Pos                 (25U)
#define I2C_CR2_AUTOEND_Msk                 (0x1UL << I2C_CR2_AUTOEND_Pos)          /*!< 0x02000000 */
#define I2C_CR2_AUTOEND                     I2C_CR2_AUTOEND_Msk                     /*!< Automatic end mode (master mode) */
#define I2C_CR2_PECBYTE_Pos                 (26U)
#define I2C_CR2_PECBYTE_Msk                 (0x1UL << I2C_CR2_PECBYTE_Pos)          /*!< 0x04000000 */
#define I2C_CR2_PECBYTE                     I2C_CR2_PECBYTE_Msk                     /*!< Packet error checking byte */

/*******************  Bit definition for I2C_OAR1 register  ******************/
#define I2C_OAR1_OA1_Pos                    (0U)
#define I2C_OAR1_OA1_Msk                    (0x3FFUL << I2C_OAR1_OA1_Pos)           /*!< 0x000003FF */
#define I2C_OAR1_OA1                        I2C_OAR1_OA1_Msk                        /*!< Interface own address 1 */
#define I2C_OAR1_OA1MODE_Pos                (10U)
#define I2C_OAR1_OA1MODE_Msk                (0x1UL << I2C_OAR1_OA1MODE_Pos)         /*!< 0x00000400 */
#define I2C_OAR1_OA1MODE                    I2C_OAR1_OA1MODE_Msk                    /*!< Own address 1 10-bit mode */
#define I2C_OAR1_OA1EN_Pos                  (15U)
#define I2C_OAR1_OA1EN_Msk                  (0x1UL << I2C_OAR1_OA1EN_Pos)           /*!< 0x00008000 */
#define I2C_OAR1_OA1EN                      I2C_OAR1_OA1EN_Msk                      /*!< Own address 1 enable */

