MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c531xx.h
/* ***********************************  Bit definition for RCC_AHB1ENR register  ************************************ */
#define RCC_AHB1ENR_Rst               (0xC0000100UL)                             /*!< RCC_AHB1ENR reset value */
#define RCC_AHB1ENR_LPDMA1EN_Pos      (0U)
#define RCC_AHB1ENR_LPDMA1EN_Msk      (0x1UL << RCC_AHB1ENR_LPDMA1EN_Pos)        /*!< 0x00000001 */
#define RCC_AHB1ENR_LPDMA1EN          RCC_AHB1ENR_LPDMA1EN_Msk                   /*!< LPDMA1 clock enable */
#define RCC_AHB1ENR_LPDMA2EN_Pos      (1U)
#define RCC_AHB1ENR_LPDMA2EN_Msk      (0x1UL << RCC_AHB1ENR_LPDMA2EN_Pos)        /*!< 0x00000002 */
#define RCC_AHB1ENR_LPDMA2EN          RCC_AHB1ENR_LPDMA2EN_Msk                   /*!< LPDMA2 clock enable */
#define RCC_AHB1ENR_FLASHEN_Pos       (8U)
#define RCC_AHB1ENR_FLASHEN_Msk       (0x1UL << RCC_AHB1ENR_FLASHEN_Pos)         /*!< 0x00000100 */
#define RCC_AHB1ENR_FLASHEN           RCC_AHB1ENR_FLASHEN_Msk                    /*!< Flash interface clock enable */
#define RCC_AHB1ENR_CRCEN_Pos         (12U)
#define RCC_AHB1ENR_CRCEN_Msk         (0x1UL << RCC_AHB1ENR_CRCEN_Pos)           /*!< 0x00001000 */
#define RCC_AHB1ENR_CRCEN             RCC_AHB1ENR_CRCEN_Msk                      /*!< CRC clock enable */
#define RCC_AHB1ENR_CORDICEN_Pos      (14U)
#define RCC_AHB1ENR_CORDICEN_Msk      (0x1UL << RCC_AHB1ENR_CORDICEN_Pos)        /*!< 0x00004000 */
#define RCC_AHB1ENR_CORDICEN          RCC_AHB1ENR_CORDICEN_Msk                   /*!< CORDIC clock enable */
#define RCC_AHB1ENR_RAMCFGEN_Pos      (17U)
#define RCC_AHB1ENR_RAMCFGEN_Msk      (0x1UL << RCC_AHB1ENR_RAMCFGEN_Pos)        /*!< 0x00020000 */
#define RCC_AHB1ENR_RAMCFGEN          RCC_AHB1ENR_RAMCFGEN_Msk                   /*!< RAMCFG clock enable */

#define RCC_AHB1ENR_SRAM2EN_Pos       (30U)
#define RCC_AHB1ENR_SRAM2EN_Msk       (0x1UL << RCC_AHB1ENR_SRAM2EN_Pos)         /*!< 0x40000000 */
#define RCC_AHB1ENR_SRAM2EN           RCC_AHB1ENR_SRAM2EN_Msk                    /*!< SRAM2 clock enable */
#define RCC_AHB1ENR_SRAM1EN_Pos       (31U)
#define RCC_AHB1ENR_SRAM1EN_Msk       (0x1UL << RCC_AHB1ENR_SRAM1EN_Pos)         /*!< 0x80000000 */
#define RCC_AHB1ENR_SRAM1EN           RCC_AHB1ENR_SRAM1EN_Msk                    /*!< SRAM1 clock enable */

/* ***********************************  Bit definition for RCC_AHB2ENR register  ************************************ */
#define RCC_AHB2ENR_Rst               (0x00000000UL)                             /*!< RCC_AHB2ENR reset value */
#define RCC_AHB2ENR_GPIOAEN_Pos       (0U)
#define RCC_AHB2ENR_GPIOAEN_Msk       (0x1UL << RCC_AHB2ENR_GPIOAEN_Pos)         /*!< 0x00000001 */
#define RCC_AHB2ENR_GPIOAEN           RCC_AHB2ENR_GPIOAEN_Msk                    /*!< GPIOA clock enable */
#define RCC_AHB2ENR_GPIOBEN_Pos       (1U)
#define RCC_AHB2ENR_GPIOBEN_Msk       (0x1UL << RCC_AHB2ENR_GPIOBEN_Pos)         /*!< 0x00000002 */
#define RCC_AHB2ENR_GPIOBEN           RCC_AHB2ENR_GPIOBEN_Msk                    /*!< GPIOB clock enable */
#define RCC_AHB2ENR_GPIOCEN_Pos       (2U)
#define RCC_AHB2ENR_GPIOCEN_Msk       (0x1UL << RCC_AHB2ENR_GPIOCEN_Pos)         /*!< 0x00000004 */
#define RCC_AHB2ENR_GPIOCEN           RCC_AHB2ENR_GPIOCEN_Msk                    /*!< GPIOC clock enable */
#define RCC_AHB2ENR_GPIODEN_Pos       (3U)
#define RCC_AHB2ENR_GPIODEN_Msk       (0x1UL << RCC_AHB2ENR_GPIODEN_Pos)         /*!< 0x00000008 */
#define RCC_AHB2ENR_GPIODEN           RCC_AHB2ENR_GPIODEN_Msk                    /*!< GPIOD clock enable */
#define RCC_AHB2ENR_GPIOEEN_Pos       (4U)
#define RCC_AHB2ENR_GPIOEEN_Msk       (0x1UL << RCC_AHB2ENR_GPIOEEN_Pos)         /*!< 0x00000010 */
#define RCC_AHB2ENR_GPIOEEN           RCC_AHB2ENR_GPIOEEN_Msk                    /*!< GPIOE clock enable */
#define RCC_AHB2ENR_GPIOHEN_Pos       (7U)
#define RCC_AHB2ENR_GPIOHEN_Msk       (0x1UL << RCC_AHB2ENR_GPIOHEN_Pos)         /*!< 0x00000080 */
#define RCC_AHB2ENR_GPIOHEN           RCC_AHB2ENR_GPIOHEN_Msk                    /*!< GPIOH clock enable */
#define RCC_AHB2ENR_ADC12EN_Pos       (10U)
#define RCC_AHB2ENR_ADC12EN_Msk       (0x1UL << RCC_AHB2ENR_ADC12EN_Pos)         /*!< 0x00000400 */
#define RCC_AHB2ENR_ADC12EN           RCC_AHB2ENR_ADC12EN_Msk                    /*!< ADC1 and ADC2 clock enable */
#define RCC_AHB2ENR_DAC1EN_Pos        (11U)
#define RCC_AHB2ENR_DAC1EN_Msk        (0x1UL << RCC_AHB2ENR_DAC1EN_Pos)          /*!< 0x00000800 */
#define RCC_AHB2ENR_DAC1EN            RCC_AHB2ENR_DAC1EN_Msk                     /*!< DAC1 clock enable */
#define RCC_AHB2ENR_HASHEN_Pos        (17U)
#define RCC_AHB2ENR_HASHEN_Msk        (0x1UL << RCC_AHB2ENR_HASHEN_Pos)          /*!< 0x00020000 */
#define RCC_AHB2ENR_HASHEN            RCC_AHB2ENR_HASHEN_Msk                     /*!< HASH clock enable */
#define RCC_AHB2ENR_RNGEN_Pos         (18U)
#define RCC_AHB2ENR_RNGEN_Msk         (0x1UL << RCC_AHB2ENR_RNGEN_Pos)           /*!< 0x00040000 */
#define RCC_AHB2ENR_RNGEN             RCC_AHB2ENR_RNGEN_Msk                      /*!< RNG clock enable */

/* ***********************************  Bit definition for RCC_APB1LENR register  *********************************** */
#define RCC_APB1LENR_Rst              (0x00000000UL)                             /*!< RCC_APB1LENR reset value */
#define RCC_APB1LENR_TIM2EN_Pos       (0U)
#define RCC_APB1LENR_TIM2EN_Msk       (0x1UL << RCC_APB1LENR_TIM2EN_Pos)         /*!< 0x00000001 */
#define RCC_APB1LENR_TIM2EN           RCC_APB1LENR_TIM2EN_Msk                    /*!< TIM2 clock enable */
#define RCC_APB1LENR_TIM6EN_Pos       (4U)
#define RCC_APB1LENR_TIM6EN_Msk       (0x1UL << RCC_APB1LENR_TIM6EN_Pos)         /*!< 0x00000010 */
#define RCC_APB1LENR_TIM6EN           RCC_APB1LENR_TIM6EN_Msk                    /*!< TIM6 clock enable */
#define RCC_APB1LENR_TIM7EN_Pos       (5U)
#define RCC_APB1LENR_TIM7EN_Msk       (0x1UL << RCC_APB1LENR_TIM7EN_Pos)         /*!< 0x00000020 */
#define RCC_APB1LENR_TIM7EN           RCC_APB1LENR_TIM7EN_Msk                    /*!< TIM7 clock enable */
#define RCC_APB1LENR_TIM12EN_Pos      (6U)
#define RCC_APB1LENR_TIM12EN_Msk      (0x1UL << RCC_APB1LENR_TIM12EN_Pos)        /*!< 0x00000040 */
#define RCC_APB1LENR_TIM12EN          RCC_APB1LENR_TIM12EN_Msk                   /*!< TIM12 clock enable */
#define RCC_APB1LENR_WWDGEN_Pos       (11U)
#define RCC_APB1LENR_WWDGEN_Msk       (0x1UL << RCC_APB1LENR_WWDGEN_Pos)         /*!< 0x00000800 */
#define RCC_APB1LENR_WWDGEN           RCC_APB1LENR_WWDGEN_Msk                    /*!< WWDG clock enable */
#define RCC_APB1LENR_OPAMP1EN_Pos     (13U)
#define RCC_APB1LENR_OPAMP1EN_Msk     (0x1UL << RCC_APB1LENR_OPAMP1EN_Pos)       /*!< 0x00002000 */
#define RCC_APB1LENR_OPAMP1EN         RCC_APB1LENR_OPAMP1EN_Msk                  /*!< OPAMP1 clock enable */
#define RCC_APB1LENR_SPI2EN_Pos       (14U)
#define RCC_APB1LENR_SPI2EN_Msk       (0x1UL << RCC_APB1LENR_SPI2EN_Pos)         /*!< 0x00004000 */
#define RCC_APB1LENR_SPI2EN           RCC_APB1LENR_SPI2EN_Msk                    /*!< SPI2 clock enable */
#define RCC_APB1LENR_USART2EN_Pos     (17U)
#define RCC_APB1LENR_USART2EN_Msk     (0x1UL << RCC_APB1LENR_USART2EN_Pos)       /*!< 0x00020000 */
#define RCC_APB1LENR_USART2EN         RCC_APB1LENR_USART2EN_Msk                  /*!< USART2 clock enable */
#define RCC_APB1LENR_UART4EN_Pos      (19U)
#define RCC_APB1LENR_UART4EN_Msk      (0x1UL << RCC_APB1LENR_UART4EN_Pos)        /*!< 0x00080000 */
#define RCC_APB1LENR_UART4EN          RCC_APB1LENR_UART4EN_Msk                   /*!< UART4 clock enable */
#define RCC_APB1LENR_UART5EN_Pos      (20U)
#define RCC_APB1LENR_UART5EN_Msk      (0x1UL << RCC_APB1LENR_UART5EN_Pos)        /*!< 0x00100000 */
#define RCC_APB1LENR_UART5EN          RCC_APB1LENR_UART5EN_Msk                   /*!< UART5 clock enable */
#define RCC_APB1LENR_I2C1EN_Pos       (21U)
#define RCC_APB1LENR_I2C1EN_Msk       (0x1UL << RCC_APB1LENR_I2C1EN_Pos)         /*!< 0x00200000 */
#define RCC_APB1LENR_I2C1EN           RCC_APB1LENR_I2C1EN_Msk                    /*!< I2C1 clock enable */
#define RCC_APB1LENR_I3C1EN_Pos       (23U)
#define RCC_APB1LENR_I3C1EN_Msk       (0x1UL << RCC_APB1LENR_I3C1EN_Pos)         /*!< 0x00800000 */
#define RCC_APB1LENR_I3C1EN           RCC_APB1LENR_I3C1EN_Msk                    /*!< I3C1 clock enable */
#define RCC_APB1LENR_CRSEN_Pos        (24U)
#define RCC_APB1LENR_CRSEN_Msk        (0x1UL << RCC_APB1LENR_CRSEN_Pos)          /*!< 0x01000000 */
#define RCC_APB1LENR_CRSEN            RCC_APB1LENR_CRSEN_Msk                     /*!< CRS clock enable */

