MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c531xx.h
/* ************************************  Bit definition for RCC_CCIPR1 register  ************************************ */
#define RCC_CCIPR1_Rst                (0x00000000UL)                             /*!< RCC_CCIPR1 reset value */
#define RCC_CCIPR1_USART1SEL_Pos      (0U)
#define RCC_CCIPR1_USART1SEL_Msk      (0x3UL << RCC_CCIPR1_USART1SEL_Pos)        /*!< 0x00000003 */
#define RCC_CCIPR1_USART1SEL          RCC_CCIPR1_USART1SEL_Msk                   /*!< USART1 kernel clock source
                                                                                      selection */
#define RCC_CCIPR1_USART1SEL_0        (0x1UL << RCC_CCIPR1_USART1SEL_Pos)        /*!< 0x00000001 */
#define RCC_CCIPR1_USART1SEL_1        (0x2UL << RCC_CCIPR1_USART1SEL_Pos)        /*!< 0x00000002 */
#define RCC_CCIPR1_USART2SEL_Pos      (2U)
#define RCC_CCIPR1_USART2SEL_Msk      (0x3UL << RCC_CCIPR1_USART2SEL_Pos)        /*!< 0x0000000C */
#define RCC_CCIPR1_USART2SEL          RCC_CCIPR1_USART2SEL_Msk                   /*!< USART2 kernel clock source
                                                                                      selection */
#define RCC_CCIPR1_USART2SEL_0        (0x1UL << RCC_CCIPR1_USART2SEL_Pos)        /*!< 0x00000004 */
#define RCC_CCIPR1_USART2SEL_1        (0x2UL << RCC_CCIPR1_USART2SEL_Pos)        /*!< 0x00000008 */
#define RCC_CCIPR1_UART4SEL_Pos       (6U)
#define RCC_CCIPR1_UART4SEL_Msk       (0x3UL << RCC_CCIPR1_UART4SEL_Pos)         /*!< 0x000000C0 */
#define RCC_CCIPR1_UART4SEL           RCC_CCIPR1_UART4SEL_Msk                    /*!< UART4 kernel clock source
                                                                                      selection */
#define RCC_CCIPR1_UART4SEL_0         (0x1UL << RCC_CCIPR1_UART4SEL_Pos)         /*!< 0x00000040 */
#define RCC_CCIPR1_UART4SEL_1         (0x2UL << RCC_CCIPR1_UART4SEL_Pos)         /*!< 0x00000080 */
#define RCC_CCIPR1_UART5SEL_Pos       (8U)
#define RCC_CCIPR1_UART5SEL_Msk       (0x3UL << RCC_CCIPR1_UART5SEL_Pos)         /*!< 0x00000300 */
#define RCC_CCIPR1_UART5SEL           RCC_CCIPR1_UART5SEL_Msk                    /*!< UART5 kernel clock source
                                                                                      selection */
#define RCC_CCIPR1_UART5SEL_0         (0x1UL << RCC_CCIPR1_UART5SEL_Pos)         /*!< 0x00000100 */
#define RCC_CCIPR1_UART5SEL_1         (0x2UL << RCC_CCIPR1_UART5SEL_Pos)         /*!< 0x00000200 */
#define RCC_CCIPR1_LPUART1SEL_Pos     (14U)
#define RCC_CCIPR1_LPUART1SEL_Msk     (0x3UL << RCC_CCIPR1_LPUART1SEL_Pos)       /*!< 0x0000C000 */
#define RCC_CCIPR1_LPUART1SEL         RCC_CCIPR1_LPUART1SEL_Msk                  /*!< LPUART1 kernel clock source
                                                                                      selection */
#define RCC_CCIPR1_LPUART1SEL_0       (0x1UL << RCC_CCIPR1_LPUART1SEL_Pos)       /*!< 0x00004000 */
#define RCC_CCIPR1_LPUART1SEL_1       (0x2UL << RCC_CCIPR1_LPUART1SEL_Pos)       /*!< 0x00008000 */
#define RCC_CCIPR1_SPI1SEL_Pos        (16U)
#define RCC_CCIPR1_SPI1SEL_Msk        (0x3UL << RCC_CCIPR1_SPI1SEL_Pos)          /*!< 0x00030000 */
#define RCC_CCIPR1_SPI1SEL            RCC_CCIPR1_SPI1SEL_Msk                     /*!< SPI1 kernel clock source selection
                                                                                      */
#define RCC_CCIPR1_SPI1SEL_0          (0x1UL << RCC_CCIPR1_SPI1SEL_Pos)          /*!< 0x00010000 */
#define RCC_CCIPR1_SPI1SEL_1          (0x2UL << RCC_CCIPR1_SPI1SEL_Pos)          /*!< 0x00020000 */
#define RCC_CCIPR1_SPI2SEL_Pos        (18U)
#define RCC_CCIPR1_SPI2SEL_Msk        (0x3UL << RCC_CCIPR1_SPI2SEL_Pos)          /*!< 0x000C0000 */
#define RCC_CCIPR1_SPI2SEL            RCC_CCIPR1_SPI2SEL_Msk                     /*!< SPI2 kernel clock source selection
                                                                                      */
#define RCC_CCIPR1_SPI2SEL_0          (0x1UL << RCC_CCIPR1_SPI2SEL_Pos)          /*!< 0x00040000 */
#define RCC_CCIPR1_SPI2SEL_1          (0x2UL << RCC_CCIPR1_SPI2SEL_Pos)          /*!< 0x00080000 */

/* ************************************  Bit definition for RCC_CCIPR2 register  ************************************ */
#define RCC_CCIPR2_Rst                (0x00000000UL)                             /*!< RCC_CCIPR2 reset value */
#define RCC_CCIPR2_I2C1SEL_Pos        (0U)
#define RCC_CCIPR2_I2C1SEL_Msk        (0x3UL << RCC_CCIPR2_I2C1SEL_Pos)          /*!< 0x00000003 */
#define RCC_CCIPR2_I2C1SEL            RCC_CCIPR2_I2C1SEL_Msk                     /*!< I2C1 kernel clock source selection
                                                                                      */
#define RCC_CCIPR2_I2C1SEL_0          (0x1UL << RCC_CCIPR2_I2C1SEL_Pos)          /*!< 0x00000001 */
#define RCC_CCIPR2_I2C1SEL_1          (0x2UL << RCC_CCIPR2_I2C1SEL_Pos)          /*!< 0x00000002 */
#define RCC_CCIPR2_I3C1SEL_Pos        (6U)
#define RCC_CCIPR2_I3C1SEL_Msk        (0x3UL << RCC_CCIPR2_I3C1SEL_Pos)          /*!< 0x000000C0 */
#define RCC_CCIPR2_I3C1SEL            RCC_CCIPR2_I3C1SEL_Msk                     /*!< I3C1 kernel clock source selection
                                                                                      */
#define RCC_CCIPR2_I3C1SEL_0          (0x1UL << RCC_CCIPR2_I3C1SEL_Pos)          /*!< 0x00000040 */
#define RCC_CCIPR2_I3C1SEL_1          (0x2UL << RCC_CCIPR2_I3C1SEL_Pos)          /*!< 0x00000080 */
#define RCC_CCIPR2_ADCDACSEL_Pos      (10U)
#define RCC_CCIPR2_ADCDACSEL_Msk      (0x3UL << RCC_CCIPR2_ADCDACSEL_Pos)        /*!< 0x00000C00 */
#define RCC_CCIPR2_ADCDACSEL          RCC_CCIPR2_ADCDACSEL_Msk                   /*!< ADC and DAC kernel clock source
                                                                                      selection */
#define RCC_CCIPR2_ADCDACSEL_0        (0x1UL << RCC_CCIPR2_ADCDACSEL_Pos)        /*!< 0x00000400 */
#define RCC_CCIPR2_ADCDACSEL_1        (0x2UL << RCC_CCIPR2_ADCDACSEL_Pos)        /*!< 0x00000800 */
/*!< ADCDAPRE configuration */
#define RCC_CCIPR2_ADCDACPRE_Pos      (12U)
#define RCC_CCIPR2_ADCDACPRE_Msk      (0x7UL << RCC_CCIPR2_ADCDACPRE_Pos)        /*!< 0x00007000 */
#define RCC_CCIPR2_ADCDACPRE          RCC_CCIPR2_ADCDACPRE_Msk                   /*!< ADCDACPRE[2:0] bits (ADC and DAC
                                                                                      prescaler for kernel clock
                                                                                      source) */
#define RCC_CCIPR2_ADCDACPRE_0        (0x1UL << RCC_CCIPR2_ADCDACPRE_Pos)        /*!< 0x00001000 */
#define RCC_CCIPR2_ADCDACPRE_1        (0x2UL << RCC_CCIPR2_ADCDACPRE_Pos)        /*!< 0x00002000 */
#define RCC_CCIPR2_ADCDACPRE_2        (0x4UL << RCC_CCIPR2_ADCDACPRE_Pos)        /*!< 0x00004000 */
#define RCC_CCIPR2_DACSEL_Pos         (15U)
#define RCC_CCIPR2_DACSEL_Msk         (0x1UL << RCC_CCIPR2_DACSEL_Pos)           /*!< 0x00008000 */
#define RCC_CCIPR2_DACSEL             RCC_CCIPR2_DACSEL_Msk                      /*!< DAC sample and hold clock */
#define RCC_CCIPR2_LPTIM1SEL_Pos      (16U)
#define RCC_CCIPR2_LPTIM1SEL_Msk      (0x3UL << RCC_CCIPR2_LPTIM1SEL_Pos)        /*!< 0x00030000 */
#define RCC_CCIPR2_LPTIM1SEL          RCC_CCIPR2_LPTIM1SEL_Msk                   /*!< LPTIM1SEL[1:0] bits (LPTIM1 kernel
                                                                                      clock source selection) */
#define RCC_CCIPR2_LPTIM1SEL_0        (0x1UL << RCC_CCIPR2_LPTIM1SEL_Pos)        /*!< 0x00010000 */
#define RCC_CCIPR2_LPTIM1SEL_1        (0x2UL << RCC_CCIPR2_LPTIM1SEL_Pos)        /*!< 0x00020000 */
#define RCC_CCIPR2_CK48SEL_Pos        (24U)
#define RCC_CCIPR2_CK48SEL_Msk        (0x3UL << RCC_CCIPR2_CK48SEL_Pos)          /*!< 0x03000000 */
#define RCC_CCIPR2_CK48SEL            RCC_CCIPR2_CK48SEL_Msk                     /*!< CK48 clock source selection */
#define RCC_CCIPR2_CK48SEL_0          (0x1UL << RCC_CCIPR2_CK48SEL_Pos)          /*!< 0x01000000 */
#define RCC_CCIPR2_CK48SEL_1          (0x2UL << RCC_CCIPR2_CK48SEL_Pos)          /*!< 0x02000000 */
#define RCC_CCIPR2_SYSTICKSEL_Pos     (30U)
#define RCC_CCIPR2_SYSTICKSEL_Msk     (0x3UL << RCC_CCIPR2_SYSTICKSEL_Pos)       /*!< 0xC0000000 */
#define RCC_CCIPR2_SYSTICKSEL         RCC_CCIPR2_SYSTICKSEL_Msk                  /*!< SYSTICK clock source selection */
#define RCC_CCIPR2_SYSTICKSEL_0       (0x1UL << RCC_CCIPR2_SYSTICKSEL_Pos)       /*!< 0x40000000 */
#define RCC_CCIPR2_SYSTICKSEL_1       (0x2UL << RCC_CCIPR2_SYSTICKSEL_Pos)       /*!< 0x80000000 */

/* ************************************  Bit definition for RCC_RTCCR register  ************************************* */
#define RCC_RTCCR_Rst                 (0x00000000UL)                             /*!< RCC_RTCCR reset value */
#define RCC_RTCCR_LSEON_Pos           (0U)
#define RCC_RTCCR_LSEON_Msk           (0x1UL << RCC_RTCCR_LSEON_Pos)             /*!< 0x00000001 */
#define RCC_RTCCR_LSEON               RCC_RTCCR_LSEON_Msk                        /*!< LSE oscillator enabled */
#define RCC_RTCCR_LSERDY_Pos          (1U)
#define RCC_RTCCR_LSERDY_Msk          (0x1UL << RCC_RTCCR_LSERDY_Pos)            /*!< 0x00000002 */
#define RCC_RTCCR_LSERDY              RCC_RTCCR_LSERDY_Msk                       /*!< LSE oscillator ready */
#define RCC_RTCCR_LSEBYP_Pos          (2U)
#define RCC_RTCCR_LSEBYP_Msk          (0x1UL << RCC_RTCCR_LSEBYP_Pos)            /*!< 0x00000004 */
#define RCC_RTCCR_LSEBYP              RCC_RTCCR_LSEBYP_Msk                       /*!< LSE oscillator bypass */
#define RCC_RTCCR_LSEDRV_Pos          (3U)
#define RCC_RTCCR_LSEDRV_Msk          (0x3UL << RCC_RTCCR_LSEDRV_Pos)            /*!< 0x00000018 */
#define RCC_RTCCR_LSEDRV              RCC_RTCCR_LSEDRV_Msk                       /*!< LSE oscillator driving capability
                                                                                      */
#define RCC_RTCCR_LSEDRV_0            (0x1UL << RCC_RTCCR_LSEDRV_Pos)            /*!< 0x00000008 */
#define RCC_RTCCR_LSEDRV_1            (0x2UL << RCC_RTCCR_LSEDRV_Pos)            /*!< 0x00000010 */
#define RCC_RTCCR_LSECSSON_Pos        (5U)
#define RCC_RTCCR_LSECSSON_Msk        (0x1UL << RCC_RTCCR_LSECSSON_Pos)          /*!< 0x00000020 */
#define RCC_RTCCR_LSECSSON            RCC_RTCCR_LSECSSON_Msk                     /*!< LSE clock security system enable
                                                                                      */
#define RCC_RTCCR_LSECSSD_Pos         (6U)
#define RCC_RTCCR_LSECSSD_Msk         (0x1UL << RCC_RTCCR_LSECSSD_Pos)           /*!< 0x00000040 */
#define RCC_RTCCR_LSECSSD             RCC_RTCCR_LSECSSD_Msk                      /*!< LSE clock security system failure
                                                                                      detection */
#define RCC_RTCCR_LSEEXT_Pos          (7U)
#define RCC_RTCCR_LSEEXT_Msk          (0x1UL << RCC_RTCCR_LSEEXT_Pos)            /*!< 0x00000080 */
#define RCC_RTCCR_LSEEXT              RCC_RTCCR_LSEEXT_Msk                       /*!< Low-speed external clock type in
                                                                                      bypass mode */
#define RCC_RTCCR_RTCSEL_Pos          (8U)
#define RCC_RTCCR_RTCSEL_Msk          (0x3UL << RCC_RTCCR_RTCSEL_Pos)            /*!< 0x00000300 */
#define RCC_RTCCR_RTCSEL              RCC_RTCCR_RTCSEL_Msk                       /*!< RTC clock source selection */
#define RCC_RTCCR_RTCSEL_0            (0x1UL << RCC_RTCCR_RTCSEL_Pos)            /*!< 0x00000100 */
#define RCC_RTCCR_RTCSEL_1            (0x2UL << RCC_RTCCR_RTCSEL_Pos)            /*!< 0x00000200 */
#define RCC_RTCCR_RTCEN_Pos           (15U)
#define RCC_RTCCR_RTCEN_Msk           (0x1UL << RCC_RTCCR_RTCEN_Pos)             /*!< 0x00008000 */
#define RCC_RTCCR_RTCEN               RCC_RTCCR_RTCEN_Msk                        /*!< RTC clock enable */
#define RCC_RTCCR_RTCDRST_Pos         (16U)
#define RCC_RTCCR_RTCDRST_Msk         (0x1UL << RCC_RTCCR_RTCDRST_Pos)           /*!< 0x00010000 */
#define RCC_RTCCR_RTCDRST             RCC_RTCCR_RTCDRST_Msk                      /*!< RTC domain software reset */
#define RCC_RTCCR_LSCOEN_Pos          (24U)
#define RCC_RTCCR_LSCOEN_Msk          (0x1UL << RCC_RTCCR_LSCOEN_Pos)            /*!< 0x01000000 */
#define RCC_RTCCR_LSCOEN              RCC_RTCCR_LSCOEN_Msk                       /*!< Low-speed clock output (LSCO)
                                                                                      enable */
#define RCC_RTCCR_LSCOSEL_Pos         (25U)
#define RCC_RTCCR_LSCOSEL_Msk         (0x1UL << RCC_RTCCR_LSCOSEL_Pos)           /*!< 0x02000000 */
#define RCC_RTCCR_LSCOSEL             RCC_RTCCR_LSCOSEL_Msk                      /*!< Low-speed clock output selection
                                                                                      */
#define RCC_RTCCR_LSION_Pos           (26U)
#define RCC_RTCCR_LSION_Msk           (0x1UL << RCC_RTCCR_LSION_Pos)             /*!< 0x04000000 */
#define RCC_RTCCR_LSION               RCC_RTCCR_LSION_Msk                        /*!< LSI oscillator enable */
#define RCC_RTCCR_LSIRDY_Pos          (27U)
#define RCC_RTCCR_LSIRDY_Msk          (0x1UL << RCC_RTCCR_LSIRDY_Pos)            /*!< 0x08000000 */
#define RCC_RTCCR_LSIRDY              RCC_RTCCR_LSIRDY_Msk                       /*!< LSI oscillator ready */

/* *************************************  Bit definition for RCC_RSR register  ************************************** */
#define RCC_RSR_Rst                   (0x00000000UL)                             /*!< RCC_RSR reset value */
#define RCC_RSR_RMVF_Pos              (23U)
#define RCC_RSR_RMVF_Msk              (0x1UL << RCC_RSR_RMVF_Pos)                /*!< 0x00800000 */
#define RCC_RSR_RMVF                  RCC_RSR_RMVF_Msk                           /*!< Remove reset flag */
#define RCC_RSR_PINRSTF_Pos           (26U)
#define RCC_RSR_PINRSTF_Msk           (0x1UL << RCC_RSR_PINRSTF_Pos)             /*!< 0x04000000 */
#define RCC_RSR_PINRSTF               RCC_RSR_PINRSTF_Msk                        /*!< Pin reset flag (NRST) */
#define RCC_RSR_BORRSTF_Pos           (27U)
#define RCC_RSR_BORRSTF_Msk           (0x1UL << RCC_RSR_BORRSTF_Pos)             /*!< 0x08000000 */
#define RCC_RSR_BORRSTF               RCC_RSR_BORRSTF_Msk                        /*!< POR reset flag */
#define RCC_RSR_SFTRSTF_Pos           (28U)
#define RCC_RSR_SFTRSTF_Msk           (0x1UL << RCC_RSR_SFTRSTF_Pos)             /*!< 0x10000000 */
#define RCC_RSR_SFTRSTF               RCC_RSR_SFTRSTF_Msk                        /*!< System reset from CPU reset flag
                                                                                      */
#define RCC_RSR_IWDGRSTF_Pos          (29U)
#define RCC_RSR_IWDGRSTF_Msk          (0x1UL << RCC_RSR_IWDGRSTF_Pos)            /*!< 0x20000000 */
#define RCC_RSR_IWDGRSTF              RCC_RSR_IWDGRSTF_Msk                       /*!< Independent watchdog reset flag */
#define RCC_RSR_WWDGRSTF_Pos          (30U)
#define RCC_RSR_WWDGRSTF_Msk          (0x1UL << RCC_RSR_WWDGRSTF_Pos)            /*!< 0x40000000 */
#define RCC_RSR_WWDGRSTF              RCC_RSR_WWDGRSTF_Msk                       /*!< Window watchdog reset flag */
#define RCC_RSR_LPWRRSTF_Pos          (31U)
#define RCC_RSR_LPWRRSTF_Msk          (0x1UL << RCC_RSR_LPWRRSTF_Pos)            /*!< 0x80000000 */
#define RCC_RSR_LPWRRSTF              RCC_RSR_LPWRRSTF_Msk                       /*!< Low-power reset flag */

