MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c531xx.h
/********************  Bit definition for TIM_TISEL register  ********************/
/*!< TI1SEL configuration */
#define TIM_TISEL_TI1SEL_Pos  (0U)
#define TIM_TISEL_TI1SEL_Msk  (0xFUL << TIM_TISEL_TI1SEL_Pos)  /*!< 0x0000000F */
#define TIM_TISEL_TI1SEL      TIM_TISEL_TI1SEL_Msk             /*!< TI1SEL[3:0] bits (Selects tim_ti1[0..15] input) */
#define TIM_TISEL_TI1SEL_0    (0x01UL << TIM_TISEL_TI1SEL_Pos) /*!< 0x00000001 */
#define TIM_TISEL_TI1SEL_1    (0x02UL << TIM_TISEL_TI1SEL_Pos) /*!< 0x00000002 */
#define TIM_TISEL_TI1SEL_2    (0x04UL << TIM_TISEL_TI1SEL_Pos) /*!< 0x00000004 */
#define TIM_TISEL_TI1SEL_3    (0x08UL << TIM_TISEL_TI1SEL_Pos) /*!< 0x00000008 */
/*!< TI2SEL configuration */
#define TIM_TISEL_TI2SEL_Pos  (8U)
#define TIM_TISEL_TI2SEL_Msk  (0xFUL << TIM_TISEL_TI2SEL_Pos)  /*!< 0x00000F00 */
#define TIM_TISEL_TI2SEL      TIM_TISEL_TI2SEL_Msk             /*!< TI2SEL[3:0] bits (Selects tim_ti2[0..15] input) */
#define TIM_TISEL_TI2SEL_0    (0x01UL << TIM_TISEL_TI2SEL_Pos) /*!< 0x00000100 */
#define TIM_TISEL_TI2SEL_1    (0x02UL << TIM_TISEL_TI2SEL_Pos) /*!< 0x00000200 */
#define TIM_TISEL_TI2SEL_2    (0x04UL << TIM_TISEL_TI2SEL_Pos) /*!< 0x00000400 */
#define TIM_TISEL_TI2SEL_3    (0x08UL << TIM_TISEL_TI2SEL_Pos) /*!< 0x00000800 */
/*!< TI3SEL configuration */
#define TIM_TISEL_TI3SEL_Pos  (16U)
#define TIM_TISEL_TI3SEL_Msk  (0xFUL << TIM_TISEL_TI3SEL_Pos)  /*!< 0x000F0000 */
#define TIM_TISEL_TI3SEL      TIM_TISEL_TI3SEL_Msk             /*!< TI3SEL[3:0] bits (Selects tim_ti3[0..15] input) */
#define TIM_TISEL_TI3SEL_0    (0x01UL << TIM_TISEL_TI3SEL_Pos) /*!< 0x00010000 */
#define TIM_TISEL_TI3SEL_1    (0x02UL << TIM_TISEL_TI3SEL_Pos) /*!< 0x00020000 */
#define TIM_TISEL_TI3SEL_2    (0x04UL << TIM_TISEL_TI3SEL_Pos) /*!< 0x00040000 */
#define TIM_TISEL_TI3SEL_3    (0x08UL << TIM_TISEL_TI3SEL_Pos) /*!< 0x00080000 */
/*!< TI4SEL configuration */
#define TIM_TISEL_TI4SEL_Pos  (24U)
#define TIM_TISEL_TI4SEL_Msk  (0xFUL << TIM_TISEL_TI4SEL_Pos)  /*!< 0x0F000000 */
#define TIM_TISEL_TI4SEL      TIM_TISEL_TI4SEL_Msk             /*!< TI4SEL[3:0] bits (Selects tim_ti4[0..15] input) */
#define TIM_TISEL_TI4SEL_0    (0x01UL << TIM_TISEL_TI4SEL_Pos) /*!< 0x01000000 */
#define TIM_TISEL_TI4SEL_1    (0x02UL << TIM_TISEL_TI4SEL_Pos) /*!< 0x02000000 */
#define TIM_TISEL_TI4SEL_2    (0x04UL << TIM_TISEL_TI4SEL_Pos) /*!< 0x04000000 */
#define TIM_TISEL_TI4SEL_3    (0x08UL << TIM_TISEL_TI4SEL_Pos) /*!< 0x08000000 */

/********************  Bit definition for TIM_AF1 register  ********************/
/*!< BKINE configuration */
#define TIM_AF1_BKINE_Pos     (0U)
#define TIM_AF1_BKINE_Msk     (0x1UL << TIM_AF1_BKINE_Pos)    /*!< 0x00000001 */
#define TIM_AF1_BKINE         TIM_AF1_BKINE_Msk               /*!< BKINE (TIMx_BKIN input enable) */
/*!< BKCMP1E configuration */
#define TIM_AF1_BKCMP1E_Pos   (1U)
#define TIM_AF1_BKCMP1E_Msk   (0x1UL << TIM_AF1_BKCMP1E_Pos)  /*!< 0x00000002 */
#define TIM_AF1_BKCMP1E       TIM_AF1_BKCMP1E_Msk             /*!< BKCMP1E (tim_brk_cmp1 enable) */
/*!< BKCMP2E configuration */
#define TIM_AF1_BKCMP2E_Pos   (2U)
#define TIM_AF1_BKCMP2E_Msk   (0x1UL << TIM_AF1_BKCMP2E_Pos)  /*!< 0x00000004 */
#define TIM_AF1_BKCMP2E       TIM_AF1_BKCMP2E_Msk             /*!< tim_brk_cmp2 enable */
/*!< BKCMP3E configuration */
#define TIM_AF1_BKCMP3E_Pos   (3U)
#define TIM_AF1_BKCMP3E_Msk   (0x1UL << TIM_AF1_BKCMP3E_Pos)  /*!< 0x00000008 */
#define TIM_AF1_BKCMP3E       TIM_AF1_BKCMP3E_Msk             /*!< tim_brk_cmp3 enable */
/*!< BKCMP4E configuration */
#define TIM_AF1_BKCMP4E_Pos   (4U)
#define TIM_AF1_BKCMP4E_Msk   (0x1UL << TIM_AF1_BKCMP4E_Pos)  /*!< 0x00000010 */
#define TIM_AF1_BKCMP4E       TIM_AF1_BKCMP4E_Msk             /*!< tim_brk_cmp4 enable */
/*!< BKCMP5E configuration */
#define TIM_AF1_BKCMP5E_Pos   (5U)
#define TIM_AF1_BKCMP5E_Msk   (0x1UL << TIM_AF1_BKCMP5E_Pos)  /*!< 0x00000020 */
#define TIM_AF1_BKCMP5E       TIM_AF1_BKCMP5E_Msk             /*!< BKCMP5E (tim_brk_cmp5 enable) */
/*!< BKCMP6E configuration */
#define TIM_AF1_BKCMP6E_Pos   (6U)
#define TIM_AF1_BKCMP6E_Msk   (0x1UL << TIM_AF1_BKCMP6E_Pos)  /*!< 0x00000040 */
#define TIM_AF1_BKCMP6E       TIM_AF1_BKCMP6E_Msk             /*!< BKCMP6E (tim_brk_cmp6 enable) */
/*!< BKCMP7E configuration */
#define TIM_AF1_BKCMP7E_Pos   (7U)
#define TIM_AF1_BKCMP7E_Msk   (0x1UL << TIM_AF1_BKCMP7E_Pos)  /*!< 0x00000080 */
#define TIM_AF1_BKCMP7E       TIM_AF1_BKCMP7E_Msk             /*!< tim_brk_cmp7 enable */
/*!< BKCMP8E configuration */
#define TIM_AF1_BKCMP8E_Pos   (8U)
#define TIM_AF1_BKCMP8E_Msk   (0x1UL << TIM_AF1_BKCMP8E_Pos)  /*!< 0x00000100 */
#define TIM_AF1_BKCMP8E       TIM_AF1_BKCMP8E_Msk             /*!< BKCMP8E (tim_brk_cmp8 enable) */
/*!< BKINP configuration */
#define TIM_AF1_BKINP_Pos     (9U)
#define TIM_AF1_BKINP_Msk     (0x1UL << TIM_AF1_BKINP_Pos)    /*!< 0x00000200 */
#define TIM_AF1_BKINP         TIM_AF1_BKINP_Msk               /*!< BKINP (TIMx_BKIN input polarity) */
/*!< BKCMP1P configuration */
#define TIM_AF1_BKCMP1P_Pos   (10U)
#define TIM_AF1_BKCMP1P_Msk   (0x1UL << TIM_AF1_BKCMP1P_Pos)  /*!< 0x00000400 */
#define TIM_AF1_BKCMP1P       TIM_AF1_BKCMP1P_Msk             /*!< BKCMP1P (tim_brk_cmp1 input polarity) */
/*!< BKCMP2P configuration */
#define TIM_AF1_BKCMP2P_Pos   (11U)
#define TIM_AF1_BKCMP2P_Msk   (0x1UL << TIM_AF1_BKCMP2P_Pos)  /*!< 0x00000800 */
#define TIM_AF1_BKCMP2P       TIM_AF1_BKCMP2P_Msk             /*!< tim_brk_cmp2 input polarity */
/*!< BKCMP3P configuration */
#define TIM_AF1_BKCMP3P_Pos   (12U)
#define TIM_AF1_BKCMP3P_Msk   (0x1UL << TIM_AF1_BKCMP3P_Pos)  /*!< 0x00001000 */
#define TIM_AF1_BKCMP3P       TIM_AF1_BKCMP3P_Msk             /*!< tim_brk_cmp3 input polarity */
/*!< BKCMP4P configuration */
#define TIM_AF1_BKCMP4P_Pos   (13U)
#define TIM_AF1_BKCMP4P_Msk   (0x1UL << TIM_AF1_BKCMP4P_Pos)  /*!< 0x00002000 */
#define TIM_AF1_BKCMP4P       TIM_AF1_BKCMP4P_Msk             /*!< tim_brk_cmp4 input polarity */
/*!< ETRSEL configuration */
#define TIM_AF1_ETRSEL_Pos    (14U)
#define TIM_AF1_ETRSEL_Msk    (0x1FUL << TIM_AF1_ETRSEL_Pos)  /*!< 0x0007C000 */
#define TIM_AF1_ETRSEL        TIM_AF1_ETRSEL_Msk              /*!< ETRSEL[4:0] bits (etr_in source selection) */
#define TIM_AF1_ETRSEL_0      (0x01UL << TIM_AF1_ETRSEL_Pos)  /*!< 0x00004000 */
#define TIM_AF1_ETRSEL_1      (0x02UL << TIM_AF1_ETRSEL_Pos)  /*!< 0x00008000 */
#define TIM_AF1_ETRSEL_2      (0x04UL << TIM_AF1_ETRSEL_Pos)  /*!< 0x00010000 */
#define TIM_AF1_ETRSEL_3      (0x08UL << TIM_AF1_ETRSEL_Pos)  /*!< 0x00020000 */
#define TIM_AF1_ETRSEL_4      (0x10UL << TIM_AF1_ETRSEL_Pos)  /*!< 0x00040000 */
/*!< BKCMP9E configuration */
#define TIM_AF1_BKCMP9E_Pos   (20U)
#define TIM_AF1_BKCMP9E_Msk   (0x1UL << TIM_AF1_BKCMP9E_Pos)  /*!< 0x00100000 */
#define TIM_AF1_BKCMP9E       TIM_AF1_BKCMP9E_Msk             /*!< BKCMP9E (tim_brk_cmp9 enable) */
/*!< BKCMP10E configuration */
#define TIM_AF1_BKCMP10E_Pos  (21U)
#define TIM_AF1_BKCMP10E_Msk  (0x1UL << TIM_AF1_BKCMP10E_Pos)  /*!< 0x00200000 */
#define TIM_AF1_BKCMP10E      TIM_AF1_BKCMP10E_Msk             /*!< BKCMP10E (tim_brk_cmp10 enable) */
/*!< BKCMP11E configuration */
#define TIM_AF1_BKCMP11E_Pos  (22U)
#define TIM_AF1_BKCMP11E_Msk  (0x1UL << TIM_AF1_BKCMP11E_Pos)  /*!< 0x00400000 */
#define TIM_AF1_BKCMP11E      TIM_AF1_BKCMP11E_Msk             /*!< tim_brk_cmp11 enable */
/*!< BKCMP12E configuration */
#define TIM_AF1_BKCMP12E_Pos  (23U)
#define TIM_AF1_BKCMP12E_Msk  (0x1UL << TIM_AF1_BKCMP12E_Pos)  /*!< 0x00800000 */
#define TIM_AF1_BKCMP12E      TIM_AF1_BKCMP12E_Msk             /*!< tim_brk_cmp12 enable */
/*!< BKCMP13E configuration */
#define TIM_AF1_BKCMP13E_Pos  (24U)
#define TIM_AF1_BKCMP13E_Msk  (0x1UL << TIM_AF1_BKCMP13E_Pos)  /*!< 0x01000000 */
#define TIM_AF1_BKCMP13E      TIM_AF1_BKCMP13E_Msk             /*!< tim_brk_cmp13 enable */
/*!< BKCMP14E configuration */
#define TIM_AF1_BKCMP14E_Pos  (25U)
#define TIM_AF1_BKCMP14E_Msk  (0x1UL << TIM_AF1_BKCMP14E_Pos)  /*!< 0x02000000 */
#define TIM_AF1_BKCMP14E      TIM_AF1_BKCMP14E_Msk             /*!< tim_brk_cmp14 enable */
/*!< BKCMP15E configuration */
#define TIM_AF1_BKCMP15E_Pos  (26U)
#define TIM_AF1_BKCMP15E_Msk  (0x1UL << TIM_AF1_BKCMP15E_Pos)  /*!< 0x04000000 */
#define TIM_AF1_BKCMP15E      TIM_AF1_BKCMP15E_Msk             /*!< tim_brk_cmp15 enable */
/*!< BKCMP16E configuration */
#define TIM_AF1_BKCMP16E_Pos  (27U)
#define TIM_AF1_BKCMP16E_Msk  (0x1UL << TIM_AF1_BKCMP16E_Pos)  /*!< 0x08000000 */
#define TIM_AF1_BKCMP16E      TIM_AF1_BKCMP16E_Msk             /*!< tim_brk_cmp16 enable */
/*!< BKCMP17E configuration */
#define TIM_AF1_BKCMP17E_Pos  (28U)
#define TIM_AF1_BKCMP17E_Msk  (0x1UL << TIM_AF1_BKCMP17E_Pos)  /*!< 0x10000000 */
#define TIM_AF1_BKCMP17E      TIM_AF1_BKCMP17E_Msk             /*!< tim_brk_cmp17 enable */
/*!< BKCMP18E configuration */
#define TIM_AF1_BKCMP18E_Pos  (29U)
#define TIM_AF1_BKCMP18E_Msk  (0x1UL << TIM_AF1_BKCMP18E_Pos)  /*!< 0x20000000 */
#define TIM_AF1_BKCMP18E      TIM_AF1_BKCMP18E_Msk             /*!< tim_brk_cmp18 enable */
/*!< BKCMP19E configuration */
#define TIM_AF1_BKCMP19E_Pos  (30U)
#define TIM_AF1_BKCMP19E_Msk  (0x1UL << TIM_AF1_BKCMP19E_Pos)  /*!< 0x40000000 */
#define TIM_AF1_BKCMP19E      TIM_AF1_BKCMP19E_Msk             /*!< tim_brk_cmp19 enable */
/*!< BKCMP20E configuration */
#define TIM_AF1_BKCMP20E_Pos  (31U)
#define TIM_AF1_BKCMP20E_Msk  (0x1UL << TIM_AF1_BKCMP20E_Pos)  /*!< 0x80000000 */
#define TIM_AF1_BKCMP20E      TIM_AF1_BKCMP20E_Msk             /*!< tim_brk_cmp20 enable */

/********************  Bit definition for TIM_AF2 register  ********************/
/*!< BK2INE configuration */
#define TIM_AF2_BK2INE_Pos    (0U)
#define TIM_AF2_BK2INE_Msk    (0x1UL << TIM_AF2_BK2INE_Pos)    /*!< 0x00000001 */
#define TIM_AF2_BK2INE        TIM_AF2_BK2INE_Msk               /*!< BK2INE (TIMx_BKIN2 input enable) */
/*!< BK2CMP1E configuration */
#define TIM_AF2_BK2CMP1E_Pos  (1U)
#define TIM_AF2_BK2CMP1E_Msk  (0x1UL << TIM_AF2_BK2CMP1E_Pos)  /*!< 0x00000002 */
#define TIM_AF2_BK2CMP1E      TIM_AF2_BK2CMP1E_Msk             /*!< BK2CMP1E (tim_brk2_cmp8 enable) */
/*!< BK2CMP2E configuration */
#define TIM_AF2_BK2CMP2E_Pos  (2U)
#define TIM_AF2_BK2CMP2E_Msk  (0x1UL << TIM_AF2_BK2CMP2E_Pos)  /*!< 0x00000004 */
#define TIM_AF2_BK2CMP2E      TIM_AF2_BK2CMP2E_Msk             /*!< tim_brk2_cmp2 enable */
/*!< BK2CMP3E configuration */
#define TIM_AF2_BK2CMP3E_Pos  (3U)
#define TIM_AF2_BK2CMP3E_Msk  (0x1UL << TIM_AF2_BK2CMP3E_Pos)  /*!< 0x00000008 */
#define TIM_AF2_BK2CMP3E      TIM_AF2_BK2CMP3E_Msk             /*!< tim_brk2_cmp3 enable */
/*!< BK2CMP4E configuration */
#define TIM_AF2_BK2CMP4E_Pos  (4U)
#define TIM_AF2_BK2CMP4E_Msk  (0x1UL << TIM_AF2_BK2CMP4E_Pos)  /*!< 0x00000010 */
#define TIM_AF2_BK2CMP4E      TIM_AF2_BK2CMP4E_Msk             /*!< tim_brk2_cmp4 enable */
/*!< BK2CMP5E configuration */
#define TIM_AF2_BK2CMP5E_Pos  (5U)
#define TIM_AF2_BK2CMP5E_Msk  (0x1UL << TIM_AF2_BK2CMP5E_Pos)  /*!< 0x00000020 */
#define TIM_AF2_BK2CMP5E      TIM_AF2_BK2CMP5E_Msk             /*!< BK2CMP5E (tim_brk2_cmp8 enable) */
/*!< BK2CMP6E configuration */
#define TIM_AF2_BK2CMP6E_Pos  (6U)
#define TIM_AF2_BK2CMP6E_Msk  (0x1UL << TIM_AF2_BK2CMP6E_Pos)  /*!< 0x00000040 */
#define TIM_AF2_BK2CMP6E      TIM_AF2_BK2CMP6E_Msk             /*!< BK2CMP6E (tim_brk2_cmp8 enable) */
/*!< BK2CMP7E configuration */
#define TIM_AF2_BK2CMP7E_Pos  (7U)
#define TIM_AF2_BK2CMP7E_Msk  (0x1UL << TIM_AF2_BK2CMP7E_Pos)  /*!< 0x00000080 */
#define TIM_AF2_BK2CMP7E      TIM_AF2_BK2CMP7E_Msk             /*!< tim_brk2_cmp7 enable */
/*!< BK2CMP8E configuration */
#define TIM_AF2_BK2CMP8E_Pos  (8U)
#define TIM_AF2_BK2CMP8E_Msk  (0x1UL << TIM_AF2_BK2CMP8E_Pos)  /*!< 0x00000100 */
#define TIM_AF2_BK2CMP8E      TIM_AF2_BK2CMP8E_Msk             /*!< tim_brk2_cmp8 enable */
/*!< BK2INP configuration */
#define TIM_AF2_BK2INP_Pos    (9U)
#define TIM_AF2_BK2INP_Msk    (0x1UL << TIM_AF2_BK2INP_Pos)    /*!< 0x00000200 */
#define TIM_AF2_BK2INP        TIM_AF2_BK2INP_Msk               /*!< BK2INP (TIMx_BKIN2 input polarity) */
/*!< BK2CMP1P configuration */
#define TIM_AF2_BK2CMP1P_Pos  (10U)
#define TIM_AF2_BK2CMP1P_Msk  (0x1UL << TIM_AF2_BK2CMP1P_Pos)  /*!< 0x00000400 */
#define TIM_AF2_BK2CMP1P      TIM_AF2_BK2CMP1P_Msk             /*!< BK2CMP1P (tim_brk2_cmp1 input polarity) */
/*!< BK2CMP2P configuration */
#define TIM_AF2_BK2CMP2P_Pos  (11U)
#define TIM_AF2_BK2CMP2P_Msk  (0x1UL << TIM_AF2_BK2CMP2P_Pos)  /*!< 0x00000800 */
#define TIM_AF2_BK2CMP2P      TIM_AF2_BK2CMP2P_Msk             /*!< tim_brk2_cmp2 input polarity */
/*!< BK2CMP3P configuration */
#define TIM_AF2_BK2CMP3P_Pos  (12U)
#define TIM_AF2_BK2CMP3P_Msk  (0x1UL << TIM_AF2_BK2CMP3P_Pos)  /*!< 0x00001000 */
#define TIM_AF2_BK2CMP3P      TIM_AF2_BK2CMP3P_Msk             /*!< tim_brk2_cmp3 input polarity */
/*!< BK2CMP4P configuration */
#define TIM_AF2_BK2CMP4P_Pos  (13U)
#define TIM_AF2_BK2CMP4P_Msk  (0x1UL << TIM_AF2_BK2CMP4P_Pos)  /*!< 0x00002000 */
#define TIM_AF2_BK2CMP4P      TIM_AF2_BK2CMP4P_Msk             /*!< tim_brk2_cmp4 input polarity */
/*!< OCRSEL configuration */
#define TIM_AF2_OCRSEL_Pos     (16U)
#define TIM_AF2_OCRSEL_Msk     (0xFUL << TIM_AF2_OCRSEL_Pos)    /*!< 0x000F0000 */
#define TIM_AF2_OCRSEL         TIM_AF2_OCRSEL_Msk               /*!< OCRSEL[3:0] bits (ocref_clr source selection) */
#define TIM_AF2_OCRSEL_0       (0x01UL << TIM_AF2_OCRSEL_Pos)   /*!< 0x00010000 */
#define TIM_AF2_OCRSEL_1       (0x02UL << TIM_AF2_OCRSEL_Pos)   /*!< 0x00020000 */
#define TIM_AF2_OCRSEL_2       (0x04UL << TIM_AF2_OCRSEL_Pos)   /*!< 0x00040000 */
#define TIM_AF2_OCRSEL_3       (0x08UL << TIM_AF2_OCRSEL_Pos)   /*!< 0x00080000 */
/*!< BK2CMP9E configuration */
#define TIM_AF2_BK2CMP9E_Pos   (20U)
#define TIM_AF2_BK2CMP9E_Msk   (0x1UL << TIM_AF2_BK2CMP9E_Pos)  /*!< 0x00100000 */
#define TIM_AF2_BK2CMP9E       TIM_AF2_BK2CMP9E_Msk             /*!< tim_brk2_cmp9 enable */
/*!< BK2CMP10E configuration */
#define TIM_AF2_BK2CMP10E_Pos  (21U)
#define TIM_AF2_BK2CMP10E_Msk  (0x1UL << TIM_AF2_BK2CMP10E_Pos) /*!< 0x00200000 */
#define TIM_AF2_BK2CMP10E      TIM_AF2_BK2CMP10E_Msk            /*!< tim_brk2_cmp10 enable */
/*!< BK2CMP11P configuration */
#define TIM_AF2_BK2CMP11E_Pos  (22U)
#define TIM_AF2_BK2CMP11E_Msk  (0x1UL << TIM_AF2_BK2CMP11E_Pos) /*!< 0x00400000 */
#define TIM_AF2_BK2CMP11E      TIM_AF2_BK2CMP11E_Msk            /*!< tim_brk2_cmp11 enable */
/*!< BK2CMP12P configuration */
#define TIM_AF2_BK2CMP12E_Pos  (23U)
#define TIM_AF2_BK2CMP12E_Msk  (0x1UL << TIM_AF2_BK2CMP12E_Pos) /*!< 0x00800000 */
#define TIM_AF2_BK2CMP12E      TIM_AF2_BK2CMP12E_Msk            /*!< tim_brk2_cmp12 enable */
/*!< BK2CMP13P configuration */
#define TIM_AF2_BK2CMP13E_Pos  (24U)
#define TIM_AF2_BK2CMP13E_Msk  (0x1UL << TIM_AF2_BK2CMP13E_Pos) /*!< 0x01000000 */
#define TIM_AF2_BK2CMP13E      TIM_AF2_BK2CMP13E_Msk            /*!< tim_brk2_cmp13 enable */
/*!< BK2CMP14P configuration */
#define TIM_AF2_BK2CMP14E_Pos  (25U)
#define TIM_AF2_BK2CMP14E_Msk  (0x1UL << TIM_AF2_BK2CMP14E_Pos) /*!< 0x02000000 */
#define TIM_AF2_BK2CMP14E      TIM_AF2_BK2CMP14E_Msk            /*!< tim_brk2_cmp14 enable */
/*!< BK2CMP15P configuration */
#define TIM_AF2_BK2CMP15E_Pos  (26U)
#define TIM_AF2_BK2CMP15E_Msk  (0x1UL << TIM_AF2_BK2CMP15E_Pos) /*!< 0x04000000 */
#define TIM_AF2_BK2CMP15E      TIM_AF2_BK2CMP15E_Msk            /*!< tim_brk2_cmp15 enable */
/*!< BK2CMP16P configuration */
#define TIM_AF2_BK2CMP16E_Pos  (27U)
#define TIM_AF2_BK2CMP16E_Msk  (0x1UL << TIM_AF2_BK2CMP16E_Pos) /*!< 0x08000000 */
#define TIM_AF2_BK2CMP16E      TIM_AF2_BK2CMP16E_Msk            /*!< tim_brk2_cmp16 enable */
/*!< BK2CMP17P configuration */
#define TIM_AF2_BK2CMP17E_Pos  (28U)
#define TIM_AF2_BK2CMP17E_Msk  (0x1UL << TIM_AF2_BK2CMP17E_Pos) /*!< 0x10000000 */
#define TIM_AF2_BK2CMP17E      TIM_AF2_BK2CMP17E_Msk            /*!< tim_brk2_cmp17 enable */
/*!< BK2CMP18P configuration */
#define TIM_AF2_BK2CMP18E_Pos  (29U)
#define TIM_AF2_BK2CMP18E_Msk  (0x1UL << TIM_AF2_BK2CMP18E_Pos) /*!< 0x20000000 */
#define TIM_AF2_BK2CMP18E      TIM_AF2_BK2CMP18E_Msk            /*!< tim_brk2_cmp18 enable */
/*!< BK2CMP19P configuration */
#define TIM_AF2_BK2CMP19E_Pos  (30U)
#define TIM_AF2_BK2CMP19E_Msk  (0x1UL << TIM_AF2_BK2CMP19E_Pos) /*!< 0x40000000 */
#define TIM_AF2_BK2CMP19E      TIM_AF2_BK2CMP19E_Msk            /*!< tim_brk2_cmp19 enable */
/*!< BK2CMP20P configuration */
#define TIM_AF2_BK2CMP20E_Pos  (31U)
#define TIM_AF2_BK2CMP20E_Msk  (0x1UL << TIM_AF2_BK2CMP20E_Pos) /*!< 0x80000000 */
#define TIM_AF2_BK2CMP20E      TIM_AF2_BK2CMP20E_Msk            /*!< tim_brk2_cmp20 enable */

/********************  Bit definition for TIM_CCR7 register  ********************/
/*!< CCR7 configuration */
#define TIM_CCR7_CCR7_Pos      (0U)
#define TIM_CCR7_CCR7_Msk      (0x000FFFFFUL << TIM_CCR7_CCR7_Pos) /*!< 0x000FFFFF */
#define TIM_CCR7_CCR7          TIM_CCR7_CCR7_Msk                   /*!< CCR7[19:0] bits (Capture/compare 7 value) */

/********************  Bit definition for TIM_CCMR4 register  ********************/
/*!< OC7FE configuration */
#define TIM_CCMR4_OC7FE_Pos    (2U)
#define TIM_CCMR4_OC7FE_Msk    (0x1UL << TIM_CCMR4_OC7FE_Pos)    /*!< 0x00000004 */
#define TIM_CCMR4_OC7FE        TIM_CCMR4_OC7FE_Msk               /*!< OC7FE (Output compare 7 fast enable) */
/*!< OC7PE configuration */
#define TIM_CCMR4_OC7PE_Pos    (3U)
#define TIM_CCMR4_OC7PE_Msk    (0x1UL << TIM_CCMR4_OC7PE_Pos)    /*!< 0x00000008 */
#define TIM_CCMR4_OC7PE        TIM_CCMR4_OC7PE_Msk               /*!< OC7PE (Output compare 7 preload enable) */
/*!< OC7M configuration */
#define TIM_CCMR4_OC7M_Pos     (4U)
#define TIM_CCMR4_OC7M_Msk     (0x3007UL << TIM_CCMR4_OC7M_Pos)  /*!< 0x00030070 */
#define TIM_CCMR4_OC7M         TIM_CCMR4_OC7M_Msk                /*!< OC7M[2:0] bits (Output compare 7 mode) */
#define TIM_CCMR4_OC7M_0       (0x0001UL << TIM_CCMR4_OC7M_Pos)  /*!< 0x00000010 */
#define TIM_CCMR4_OC7M_1       (0x0002UL << TIM_CCMR4_OC7M_Pos)  /*!< 0x00000020 */
#define TIM_CCMR4_OC7M_2       (0x0004UL << TIM_CCMR4_OC7M_Pos)  /*!< 0x00000040 */
#define TIM_CCMR4_OC7M_3       (0x1000UL << TIM_CCMR4_OC7M_Pos)  /*!< 0x00010000 */
#define TIM_CCMR4_OC7M_4       (0x2000UL << TIM_CCMR4_OC7M_Pos)  /*!< 0x00020000 */
/*!< OC7CE configuration */
#define TIM_CCMR4_OC7CE_Pos    (7U)
#define TIM_CCMR4_OC7CE_Msk    (0x1UL << TIM_CCMR4_OC7CE_Pos)    /*!< 0x00000080 */
#define TIM_CCMR4_OC7CE        TIM_CCMR4_OC7CE_Msk               /*!< OC7CE (Output compare 7 clear enable) */

